Komidass/Hotel_Room/tm4c123gh6pm_modified.h
/*
 * tm4c123gh6om_modified.h
 *
 *  Created on: May 17, 2020
 *      Author: tho
 */

#ifndef TM4C123GH6PM_MODIFIED_H_
#define TM4C123GH6PM_MODIFIED_H_

//*****************************************************************************
//
// tm4c123gh6pm.h - TM4C123GH6PM Register Definitions
//
// Copyright (c) 2013-2014 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision 2.1.0.12573 of the Tiva Firmware Development Package.
//
//*****************************************************************************

/*
 * some defines for GPIO
 */
#define PORTA 0x00000001
#define PORTB 0x00000002
#define PORTC 0x00000004
#define PORTD 0x00000008
#define PORTE 0x00000004
#define PORTF 0x00000010

#define PIN0 0x00000001
#define PIN1 0x00000002
#define PIN2 0x00000004
#define PIN3 0x00000008
#define PIN4 0x00000010
#define PIN5 0x00000020
#define PIN6 0x00000040
#define PIN7 0x00000080

#define OUTPUT 0x00000001
#define INPUT  0x00000000

//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************
#define INT_GPIOA               16          // GPIO Port A
#define INT_GPIOB               17          // GPIO Port B
#define INT_GPIOC               18          // GPIO Port C
#define INT_GPIOD               19          // GPIO Port D
#define INT_GPIOE               20          // GPIO Port E
#define INT_UART0               21          // UART0
#define INT_UART1               22          // UART1
#define INT_SSI0                23          // SSI0
#define INT_I2C0                24          // I2C0
#define INT_PWM0_FAULT          25          // PWM0 Fault
#define INT_PWM0_0              26          // PWM0 Generator 0
#define INT_PWM0_1              27          // PWM0 Generator 1
#define INT_PWM0_2              28          // PWM0 Generator 2
#define INT_QEI0                29          // QEI0
#define INT_ADC0SS0             30          // ADC0 Sequence 0
#define INT_ADC0SS1             31          // ADC0 Sequence 1
#define INT_ADC0SS2             32          // ADC0 Sequence 2
#define INT_ADC0SS3             33          // ADC0 Sequence 3
#define INT_WATCHDOG            34          // Watchdog Timers 0 and 1
#define INT_TIMER0A             35          // 16/32-Bit Timer 0A
#define INT_TIMER0B             36          // 16/32-Bit Timer 0B
#define INT_TIMER1A             37          // 16/32-Bit Timer 1A
#define INT_TIMER1B             38          // 16/32-Bit Timer 1B
#define INT_TIMER2A             39          // 16/32-Bit Timer 2A
#define INT_TIMER2B             40          // 16/32-Bit Timer 2B
#define INT_COMP0               41          // Analog Comparator 0
#define INT_COMP1               42          // Analog Comparator 1
#define INT_SYSCTL              44          // System Control
#define INT_FLASH               45          // Flash Memory Control and EEPROM
                                            // Control
#define INT_GPIOF               46          // GPIO Port F
#define INT_UART2               49          // UART2
#define INT_SSI1                50          // SSI1
#define INT_TIMER3A             51          // 16/32-Bit Timer 3A
#define INT_TIMER3B             52          // Timer 3B
#define INT_I2C1                53          // I2C1
#define INT_QEI1                54          // QEI1
#define INT_CAN0                55          // CAN0
#define INT_CAN1                56          // CAN1
#define INT_HIBERNATE           59          // Hibernation Module
#define INT_USB0                60          // USB
#define INT_PWM0_3              61          // PWM Generator 3
#define INT_UDMA                62          // uDMA Software
#define INT_UDMAERR             63          // uDMA Error
#define INT_ADC1SS0             64          // ADC1 Sequence 0
#define INT_ADC1SS1             65          // ADC1 Sequence 1
#define INT_ADC1SS2             66          // ADC1 Sequence 2
#define INT_ADC1SS3             67          // ADC1 Sequence 3
#define INT_SSI2                73          // SSI2
#define INT_SSI3                74          // SSI3
#define INT_UART3               75          // UART3
#define INT_UART4               76          // UART4
#define INT_UART5               77          // UART5
#define INT_UART6               78          // UART6
#define INT_UART7               79          // UART7
#define INT_I2C2                84          // I2C2
#define INT_I2C3                85          // I2C3
#define INT_TIMER4A             86          // 16/32-Bit Timer 4A
#define INT_TIMER4B             87          // 16/32-Bit Timer 4B
#define INT_TIMER5A             108         // 16/32-Bit Timer 5A
#define INT_TIMER5B             109         // 16/32-Bit Timer 5B
#define INT_WTIMER0A            110         // 32/64-Bit Timer 0A
#define INT_WTIMER0B            111         // 32/64-Bit Timer 0B
#define INT_WTIMER1A            112         // 32/64-Bit Timer 1A
#define INT_WTIMER1B            113         // 32/64-Bit Timer 1B
#define INT_WTIMER2A            114         // 32/64-Bit Timer 2A
#define INT_WTIMER2B            115         // 32/64-Bit Timer 2B
#define INT_WTIMER3A            116         // 32/64-Bit Timer 3A
#define INT_WTIMER3B            117         // 32/64-Bit Timer 3B
#define INT_WTIMER4A            118         // 32/64-Bit Timer 4A
#define INT_WTIMER4B            119         // 32/64-Bit Timer 4B
#define INT_WTIMER5A            120         // 32/64-Bit Timer 5A
#define INT_WTIMER5B            121         // 32/64-Bit Timer 5B
#define INT_SYSEXC              122         // System Exception (imprecise)
#define INT_PWM1_0              150         // PWM1 Generator 0
#define INT_PWM1_1              151         // PWM1 Generator 1
#define INT_PWM1_2              152         // PWM1 Generator 2
#define INT_PWM1_3              153         // PWM1 Generator 3
#define INT_PWM1_FAULT          154         // PWM1 Fault

//*****************************************************************************
//
// Watchdog Timer registers (WATCHDOG0)
//
//*****************************************************************************
#define WATCHDOG0_LOAD_R         0x40000000
#define WATCHDOG0_VALUE_R        0x40000004
#define WATCHDOG0_CTL_R          0x40000008
#define WATCHDOG0_ICR_R          0x4000000C
#define WATCHDOG0_RIS_R          0x40000010
#define WATCHDOG0_MIS_R          0x40000014
#define WATCHDOG0_TEST_R         0x40000418
#define WATCHDOG0_LOCK_R         0x40000C00

//*****************************************************************************
//
// Watchdog Timer registers (WATCHDOG1)
//
//*****************************************************************************
#define WATCHDOG1_LOAD_R         0x40001000
#define WATCHDOG1_VALUE_R        0x40001004
#define WATCHDOG1_CTL_R          0x40001008
#define WATCHDOG1_ICR_R          0x4000100C
#define WATCHDOG1_RIS_R          0x40001010
#define WATCHDOG1_MIS_R          0x40001014
#define WATCHDOG1_TEST_R         0x40001418
#define WATCHDOG1_LOCK_R         0x40001C00

//*****************************************************************************
//
// GPIO registers (PORTA)
//
//*****************************************************************************
#define GPIO_PORTA_DATA_BITS_R   0x40004000
#define GPIO_PORTA_DATA_R        0x400043FC
#define GPIO_PORTA_DIR_R         0x40004400
#define GPIO_PORTA_IS_R          0x40004404
#define GPIO_PORTA_IBE_R         0x40004408
#define GPIO_PORTA_IEV_R         0x4000440C
#define GPIO_PORTA_IM_R          0x40004410
#define GPIO_PORTA_RIS_R         0x40004414
#define GPIO_PORTA_MIS_R         0x4000441
#define GPIO_PORTA_ICR_R         0x4000441C
#define GPIO_PORTA_AFSEL_R       0x40004420
#define GPIO_PORTA_DR2R_R        0x40004500
#define GPIO_PORTA_DR4R_R        0x40004504
#define GPIO_PORTA_DR8R_R        0x40004508
#define GPIO_PORTA_ODR_R         0x4000450C
#define GPIO_PORTA_PUR_R         0x40004510
#define GPIO_PORTA_PDR_R         0x40004514
#define GPIO_PORTA_SLR_R         0x40004518
#define GPIO_PORTA_DEN_R         0x4000451C
#define GPIO_PORTA_LOCK_R        0x40004520
#define GPIO_PORTA_CR_R          0x40004524
#define GPIO_PORTA_AMSEL_R       0x40004528
#define GPIO_PORTA_PCTL_R        0x4000452C
#define GPIO_PORTA_ADCCTL_R      0x40004530
#define GPIO_PORTA_DMACTL_R      0x40004534

//*****************************************************************************
//
// GPIO registers (PORTB)
//
//*****************************************************************************
#define GPIO_PORTB_DATA_BITS_R   0x40005000
#define GPIO_PORTB_DATA_R        0x400053FC 
#define GPIO_PORTB_DIR_R         0x40005400 
#define GPIO_PORTB_IS_R          0x40005404 
#define GPIO_PORTB_IBE_R         0x40005408 
#define GPIO_PORTB_IEV_R         0x4000540C 
#define GPIO_PORTB_IM_R          0x40005410 
#define GPIO_PORTB_RIS_R         0x40005414 
#define GPIO_PORTB_MIS_R         0x40005418 
#define GPIO_PORTB_ICR_R         0x4000541C 
#define GPIO_PORTB_AFSEL_R       0x40005420 
#define GPIO_PORTB_DR2R_R        0x40005500 
#define GPIO_PORTB_DR4R_R        0x40005504 
#define GPIO_PORTB_DR8R_R        0x40005508 
#define GPIO_PORTB_ODR_R         0x4000550C 
#define GPIO_PORTB_PUR_R         0x40005510 
#define GPIO_PORTB_PDR_R         0x40005514 
#define GPIO_PORTB_SLR_R         0x40005518 
#define GPIO_PORTB_DEN_R         0x4000551C 
#define GPIO_PORTB_LOCK_R        0x40005520 
#define GPIO_PORTB_CR_R          0x40005524 
#define GPIO_PORTB_AMSEL_R       0x40005528 
#define GPIO_PORTB_PCTL_R        0x4000552C 
#define GPIO_PORTB_ADCCTL_R      0x40005530 
#define GPIO_PORTB_DMACTL_R      0x40005534 

//*****************************************************************************
//
// GPIO registers (PORTC)
//
//*****************************************************************************
#define GPIO_PORTC_DATA_BITS_R   0x40006000)
#define GPIO_PORTC_DATA_R        0x400063FC 
#define GPIO_PORTC_DIR_R         0x40006400 
#define GPIO_PORTC_IS_R          0x40006404 
#define GPIO_PORTC_IBE_R         0x40006408 
#define GPIO_PORTC_IEV_R         0x4000640C 
#define GPIO_PORTC_IM_R          0x40006410 
#define GPIO_PORTC_RIS_R         0x40006414 
#define GPIO_PORTC_MIS_R         0x40006418 
#define GPIO_PORTC_ICR_R         0x4000641C 
#define GPIO_PORTC_AFSEL_R       0x40006420 
#define GPIO_PORTC_DR2R_R        0x40006500 
#define GPIO_PORTC_DR4R_R        0x40006504 
#define GPIO_PORTC_DR8R_R        0x40006508 
#define GPIO_PORTC_ODR_R         0x4000650C 
#define GPIO_PORTC_PUR_R         0x40006510 
#define GPIO_PORTC_PDR_R         0x40006514 
#define GPIO_PORTC_SLR_R         0x40006518 
#define GPIO_PORTC_DEN_R         0x4000651C 
#define GPIO_PORTC_LOCK_R        0x40006520 
#define GPIO_PORTC_CR_R          0x40006524 
#define GPIO_PORTC_AMSEL_R       0x40006528 
#define GPIO_PORTC_PCTL_R        0x4000652C 
#define GPIO_PORTC_ADCCTL_R      0x40006530 
#define GPIO_PORTC_DMACTL_R      0x40006534 

//*****************************************************************************
//
// GPIO registers (PORTD)
//
//*****************************************************************************
#define GPIO_PORTD_DATA_BITS_R   0x40007000
#define GPIO_PORTD_DATA_R        0x400073FC 
#define GPIO_PORTD_DIR_R         0x40007400 
#define GPIO_PORTD_IS_R          0x40007404 
#define GPIO_PORTD_IBE_R         0x40007408 
#define GPIO_PORTD_IEV_R         0x4000740C 
#define GPIO_PORTD_IM_R          0x40007410 
#define GPIO_PORTD_RIS_R         0x40007414 
#define GPIO_PORTD_MIS_R         0x40007418 
#define GPIO_PORTD_ICR_R         0x4000741C 
#define GPIO_PORTD_AFSEL_R       0x40007420 
#define GPIO_PORTD_DR2R_R        0x40007500 
#define GPIO_PORTD_DR4R_R        0x40007504 
#define GPIO_PORTD_DR8R_R        0x40007508 
#define GPIO_PORTD_ODR_R         0x4000750C 
#define GPIO_PORTD_PUR_R         0x40007510 
#define GPIO_PORTD_PDR_R         0x40007514 
#define GPIO_PORTD_SLR_R         0x40007518 
#define GPIO_PORTD_DEN_R         0x4000751C 
#define GPIO_PORTD_LOCK_R        0x40007520 
#define GPIO_PORTD_CR_R          0x40007524 
#define GPIO_PORTD_AMSEL_R       0x40007528 
#define GPIO_PORTD_PCTL_R        0x4000752C 
#define GPIO_PORTD_ADCCTL_R      0x40007530 
#define GPIO_PORTD_DMACTL_R      0x40007534 

//*****************************************************************************
//
// SSI registers (SSI0)
//
//*****************************************************************************
#define SSI0_CR0_R               0x40008000 
#define SSI0_CR1_R               0x40008004 
#define SSI0_DR_R                0x40008008 
#define SSI0_SR_R                0x4000800C 
#define SSI0_CPSR_R              0x40008010 
#define SSI0_IM_R                0x40008014 
#define SSI0_RIS_R               0x40008018 
#define SSI0_MIS_R               0x4000801C 
#define SSI0_ICR_R               0x40008020 
#define SSI0_DMACTL_R            0x40008024 
#define SSI0_CC_R                0x40008FC8 

//*****************************************************************************
//
// SSI registers (SSI1)
//
//*****************************************************************************
#define SSI1_CR0_R               0x40009000 
#define SSI1_CR1_R               0x40009004 
#define SSI1_DR_R                0x40009008 
#define SSI1_SR_R                0x4000900C 
#define SSI1_CPSR_R              0x40009010 
#define SSI1_IM_R                0x40009014 
#define SSI1_RIS_R               0x40009018 
#define SSI1_MIS_R               0x4000901C 
#define SSI1_ICR_R               0x40009020 
#define SSI1_DMACTL_R            0x40009024 
#define SSI1_CC_R                0x40009FC8 

//*****************************************************************************
//
// SSI registers (SSI2)
//
//*****************************************************************************
#define SSI2_CR0_R               0x4000A000 
#define SSI2_CR1_R               0x4000A004 
#define SSI2_DR_R                0x4000A008 
#define SSI2_SR_R                0x4000A00C 
#define SSI2_CPSR_R              0x4000A010 
#define SSI2_IM_R                0x4000A014 
#define SSI2_RIS_R               0x4000A018 
#define SSI2_MIS_R               0x4000A01C 
#define SSI2_ICR_R               0x4000A020 
#define SSI2_DMACTL_R            0x4000A024 
#define SSI2_CC_R                0x4000AFC8 

//*****************************************************************************
//
// SSI registers (SSI3)
//
//*****************************************************************************
#define SSI3_CR0_R               0x4000B000 
#define SSI3_CR1_R               0x4000B004 
#define SSI3_DR_R                0x4000B008 
#define SSI3_SR_R                0x4000B00C 
#define SSI3_CPSR_R              0x4000B010 
#define SSI3_IM_R                0x4000B014 
#define SSI3_RIS_R               0x4000B018 
#define SSI3_MIS_R               0x4000B01C 
#define SSI3_ICR_R               0x4000B020 
#define SSI3_DMACTL_R            0x4000B024 
#define SSI3_CC_R                0x4000BFC8 

//*****************************************************************************
//
// UART registers (UART0)
//
//*****************************************************************************
#define UART0_DR_R               0x4000C000 
#define UART0_RSR_R              0x4000C004 
#define UART0_ECR_R              0x4000C004 
#define UART0_FR_R               0x4000C018 
#define UART0_ILPR_R             0x4000C020 
#define UART0_IBRD_R             0x4000C024 
#define UART0_FBRD_R             0x4000C028 
#define UART0_LCRH_R             0x4000C02C 
#define UART0_CTL_R              0x4000C030 
#define UART0_IFLS_R             0x4000C034 
#define UART0_IM_R               0x4000C038 
#define UART0_RIS_R              0x4000C03C 
#define UART0_MIS_R              0x4000C040 
#define UART0_ICR_R              0x4000C044 
#define UART0_DMACTL_R           0x4000C048 
#define UART0_9BITADDR_R         0x4000C0A4 
#define UART0_9BITAMASK_R        0x4000C0A8 
#define UART0_PP_R               0x4000CFC0 
#define UART0_CC_R               0x4000CFC8 

//*****************************************************************************
//
// UART registers (UART1)
//
//*****************************************************************************
#define UART1_DR_R               0x4000D000 
#define UART1_RSR_R              0x4000D004 
#define UART1_ECR_R              0x4000D004 
#define UART1_FR_R               0x4000D018 
#define UART1_ILPR_R             0x4000D020 
#define UART1_IBRD_R             0x4000D024 
#define UART1_FBRD_R             0x4000D028 
#define UART1_LCRH_R             0x4000D02C 
#define UART1_CTL_R              0x4000D030 
#define UART1_IFLS_R             0x4000D034 
#define UART1_IM_R               0x4000D038 
#define UART1_RIS_R              0x4000D03C 
#define UART1_MIS_R              0x4000D040 
#define UART1_ICR_R              0x4000D044 
#define UART1_DMACTL_R           0x4000D048 
#define UART1_9BITADDR_R         0x4000D0A4 
#define UART1_9BITAMASK_R        0x4000D0A8 
#define UART1_PP_R               0x4000DFC0 
#define UART1_CC_R               0x4000DFC8 

//*****************************************************************************
//
// UART registers (UART2)
//
//*****************************************************************************
#define UART2_DR_R               0x4000E000 
#define UART2_RSR_R              0x4000E004 
#define UART2_ECR_R              0x4000E004 
#define UART2_FR_R               0x4000E018 
#define UART2_ILPR_R             0x4000E020 
#define UART2_IBRD_R             0x4000E024 
#define UART2_FBRD_R             0x4000E028 
#define UART2_LCRH_R             0x4000E02C 
#define UART2_CTL_R              0x4000E030 
#define UART2_IFLS_R             0x4000E034 
#define UART2_IM_R               0x4000E038 
#define UART2_RIS_R              0x4000E03C 
#define UART2_MIS_R              0x4000E040 
#define UART2_ICR_R              0x4000E044 
#define UART2_DMACTL_R           0x4000E048 
#define UART2_9BITADDR_R         0x4000E0A4 
#define UART2_9BITAMASK_R        0x4000E0A8 
#define UART2_PP_R               0x4000EFC0 
#define UART2_CC_R               0x4000EFC8 

//*****************************************************************************
//
// UART registers (UART3)
//
//*****************************************************************************
#define UART3_DR_R               0x4000F000 
#define UART3_RSR_R              0x4000F004 
#define UART3_ECR_R              0x4000F004 
#define UART3_FR_R               0x4000F018 
#define UART3_ILPR_R             0x4000F020 
#define UART3_IBRD_R             0x4000F024 
#define UART3_FBRD_R             0x4000F028 
#define UART3_LCRH_R             0x4000F02C 
#define UART3_CTL_R              0x4000F030 
#define UART3_IFLS_R             0x4000F034 
#define UART3_IM_R               0x4000F038 
#define UART3_RIS_R              0x4000F03C 
#define UART3_MIS_R              0x4000F040 
#define UART3_ICR_R              0x4000F044 
#define UART3_DMACTL_R           0x4000F048 
#define UART3_9BITADDR_R         0x4000F0A4 
#define UART3_9BITAMASK_R        0x4000F0A8 
#define UART3_PP_R               0x4000FFC0 
#define UART3_CC_R               0x4000FFC8 

//*****************************************************************************
//
// UART registers (UART4)
//
//*****************************************************************************
#define UART4_DR_R               0x40010000 
#define UART4_RSR_R              0x40010004 
#define UART4_ECR_R              0x40010004 
#define UART4_FR_R               0x40010018 
#define UART4_ILPR_R             0x40010020 
#define UART4_IBRD_R             0x40010024 
#define UART4_FBRD_R             0x40010028 
#define UART4_LCRH_R             0x4001002C 
#define UART4_CTL_R              0x40010030 
#define UART4_IFLS_R             0x40010034 
#define UART4_IM_R               0x40010038 
#define UART4_RIS_R              0x4001003C 
#define UART4_MIS_R              0x40010040 
#define UART4_ICR_R              0x40010044 
#define UART4_DMACTL_R           0x40010048 
#define UART4_9BITADDR_R         0x400100A4 
#define UART4_9BITAMASK_R        0x400100A8 
#define UART4_PP_R               0x40010FC0 
#define UART4_CC_R               0x40010FC8 

//*****************************************************************************
//
// UART registers (UART5)
//
//*****************************************************************************
#define UART5_DR_R               0x40011000 
#define UART5_RSR_R              0x40011004 
#define UART5_ECR_R              0x40011004 
#define UART5_FR_R               0x40011018 
#define UART5_ILPR_R             0x40011020 
#define UART5_IBRD_R             0x40011024 
#define UART5_FBRD_R             0x40011028 
#define UART5_LCRH_R             0x4001102C 
#define UART5_CTL_R              0x40011030 
#define UART5_IFLS_R             0x40011034 
#define UART5_IM_R               0x40011038 
#define UART5_RIS_R              0x4001103C 
#define UART5_MIS_R              0x40011040 
#define UART5_ICR_R              0x40011044 
#define UART5_DMACTL_R           0x40011048 
#define UART5_9BITADDR_R         0x400110A4 
#define UART5_9BITAMASK_R        0x400110A8 
#define UART5_PP_R               0x40011FC0 
#define UART5_CC_R               0x40011FC8 

//*****************************************************************************
//
// UART registers (UART6)
//
//*****************************************************************************
#define UART6_DR_R               0x40012000 
#define UART6_RSR_R              0x40012004 
#define UART6_ECR_R              0x40012004 
#define UART6_FR_R               0x40012018 
#define UART6_ILPR_R             0x40012020 
#define UART6_IBRD_R             0x40012024 
#define UART6_FBRD_R             0x40012028 
#define UART6_LCRH_R             0x4001202C 
#define UART6_CTL_R              0x40012030 
#define UART6_IFLS_R             0x40012034 
#define UART6_IM_R               0x40012038 
#define UART6_RIS_R              0x4001203C 
#define UART6_MIS_R              0x40012040 
#define UART6_ICR_R              0x40012044 
#define UART6_DMACTL_R           0x40012048 
#define UART6_9BITADDR_R         0x400120A4 
#define UART6_9BITAMASK_R        0x400120A8 
#define UART6_PP_R               0x40012FC0 
#define UART6_CC_R               0x40012FC8 

