Komidass/Hotel_Room/tm4c123gh6pm_modified.h
//*****************************************************************************
//
// UART registers (UART7)
//
//*****************************************************************************
#define UART7_DR_R               0x40013000 
#define UART7_RSR_R              0x40013004 
#define UART7_ECR_R              0x40013004 
#define UART7_FR_R               0x40013018 
#define UART7_ILPR_R             0x40013020 
#define UART7_IBRD_R             0x40013024 
#define UART7_FBRD_R             0x40013028 
#define UART7_LCRH_R             0x4001302C 
#define UART7_CTL_R              0x40013030 
#define UART7_IFLS_R             0x40013034 
#define UART7_IM_R               0x40013038 
#define UART7_RIS_R              0x4001303C 
#define UART7_MIS_R              0x40013040 
#define UART7_ICR_R              0x40013044 
#define UART7_DMACTL_R           0x40013048 
#define UART7_9BITADDR_R         0x400130A4 
#define UART7_9BITAMASK_R        0x400130A8 
#define UART7_PP_R               0x40013FC0 
#define UART7_CC_R               0x40013FC8 

//*****************************************************************************
//
// I2C registers (I2C0)
//
//*****************************************************************************
#define I2C0_MSA_R               0x40020000 
#define I2C0_MCS_R               0x40020004 
#define I2C0_MDR_R               0x40020008 
#define I2C0_MTPR_R              0x4002000C 
#define I2C0_MIMR_R              0x40020010 
#define I2C0_MRIS_R              0x40020014 
#define I2C0_MMIS_R              0x40020018 
#define I2C0_MICR_R              0x4002001C 
#define I2C0_MCR_R               0x40020020 
#define I2C0_MCLKOCNT_R          0x40020024 
#define I2C0_MBMON_R             0x4002002C 
#define I2C0_MCR2_R              0x40020038 
#define I2C0_SOAR_R              0x40020800 
#define I2C0_SCSR_R              0x40020804 
#define I2C0_SDR_R               0x40020808 
#define I2C0_SIMR_R              0x4002080C 
#define I2C0_SRIS_R              0x40020810 
#define I2C0_SMIS_R              0x40020814 
#define I2C0_SICR_R              0x40020818 
#define I2C0_SOAR2_R             0x4002081C 
#define I2C0_SACKCTL_R           0x40020820 
#define I2C0_PP_R                0x40020FC0 
#define I2C0_PC_R                0x40020FC4 

//*****************************************************************************
//
// I2C registers (I2C1)
//
//*****************************************************************************
#define I2C1_MSA_R               0x40021000 
#define I2C1_MCS_R               0x40021004 
#define I2C1_MDR_R               0x40021008 
#define I2C1_MTPR_R              0x4002100C 
#define I2C1_MIMR_R              0x40021010 
#define I2C1_MRIS_R              0x40021014 
#define I2C1_MMIS_R              0x40021018 
#define I2C1_MICR_R              0x4002101C 
#define I2C1_MCR_R               0x40021020 
#define I2C1_MCLKOCNT_R          0x40021024 
#define I2C1_MBMON_R             0x4002102C 
#define I2C1_MCR2_R              0x40021038 
#define I2C1_SOAR_R              0x40021800 
#define I2C1_SCSR_R              0x40021804 
#define I2C1_SDR_R               0x40021808 
#define I2C1_SIMR_R              0x4002180C 
#define I2C1_SRIS_R              0x40021810 
#define I2C1_SMIS_R              0x40021814 
#define I2C1_SICR_R              0x40021818 
#define I2C1_SOAR2_R             0x4002181C 
#define I2C1_SACKCTL_R           0x40021820 
#define I2C1_PP_R                0x40021FC0 
#define I2C1_PC_R                0x40021FC4 

//*****************************************************************************
//
// I2C registers (I2C2)
//
//*****************************************************************************
#define I2C2_MSA_R               0x40022000 
#define I2C2_MCS_R               0x40022004 
#define I2C2_MDR_R               0x40022008 
#define I2C2_MTPR_R              0x4002200C 
#define I2C2_MIMR_R              0x40022010 
#define I2C2_MRIS_R              0x40022014 
#define I2C2_MMIS_R              0x40022018 
#define I2C2_MICR_R              0x4002201C 
#define I2C2_MCR_R               0x40022020 
#define I2C2_MCLKOCNT_R          0x40022024 
#define I2C2_MBMON_R             0x4002202C 
#define I2C2_MCR2_R              0x40022038 
#define I2C2_SOAR_R              0x40022800 
#define I2C2_SCSR_R              0x40022804 
#define I2C2_SDR_R               0x40022808 
#define I2C2_SIMR_R              0x4002280C 
#define I2C2_SRIS_R              0x40022810 
#define I2C2_SMIS_R              0x40022814 
#define I2C2_SICR_R              0x40022818 
#define I2C2_SOAR2_R             0x4002281C 
#define I2C2_SACKCTL_R           0x40022820 
#define I2C2_PP_R                0x40022FC0 
#define I2C2_PC_R                0x40022FC4 

//*****************************************************************************
//
// I2C registers (I2C3)
//
//*****************************************************************************
#define I2C3_MSA_R               0x40023000 
#define I2C3_MCS_R               0x40023004 
#define I2C3_MDR_R               0x40023008 
#define I2C3_MTPR_R              0x4002300C 
#define I2C3_MIMR_R              0x40023010 
#define I2C3_MRIS_R              0x40023014 
#define I2C3_MMIS_R              0x40023018 
#define I2C3_MICR_R              0x4002301C 
#define I2C3_MCR_R               0x40023020 
#define I2C3_MCLKOCNT_R          0x40023024 
#define I2C3_MBMON_R             0x4002302C 
#define I2C3_MCR2_R              0x40023038 
#define I2C3_SOAR_R              0x40023800 
#define I2C3_SCSR_R              0x40023804 
#define I2C3_SDR_R               0x40023808 
#define I2C3_SIMR_R              0x4002380C 
#define I2C3_SRIS_R              0x40023810 
#define I2C3_SMIS_R              0x40023814 
#define I2C3_SICR_R              0x40023818 
#define I2C3_SOAR2_R             0x4002381C 
#define I2C3_SACKCTL_R           0x40023820 
#define I2C3_PP_R                0x40023FC0 
#define I2C3_PC_R                0x40023FC4 

//*****************************************************************************
//
// GPIO registers (PORTE)
//
//*****************************************************************************
#define GPIO_PORTE_DATA_BITS_R   0x40024000)
#define GPIO_PORTE_DATA_R        0x400243FC 
#define GPIO_PORTE_DIR_R         0x40024400 
#define GPIO_PORTE_IS_R          0x40024404 
#define GPIO_PORTE_IBE_R         0x40024408 
#define GPIO_PORTE_IEV_R         0x4002440C 
#define GPIO_PORTE_IM_R          0x40024410 
#define GPIO_PORTE_RIS_R         0x40024414 
#define GPIO_PORTE_MIS_R         0x40024418 
#define GPIO_PORTE_ICR_R         0x4002441C 
#define GPIO_PORTE_AFSEL_R       0x40024420 
#define GPIO_PORTE_DR2R_R        0x40024500 
#define GPIO_PORTE_DR4R_R        0x40024504 
#define GPIO_PORTE_DR8R_R        0x40024508 
#define GPIO_PORTE_ODR_R         0x4002450C 
#define GPIO_PORTE_PUR_R         0x40024510 
#define GPIO_PORTE_PDR_R         0x40024514 
#define GPIO_PORTE_SLR_R         0x40024518 
#define GPIO_PORTE_DEN_R         0x4002451C 
#define GPIO_PORTE_LOCK_R        0x40024520 
#define GPIO_PORTE_CR_R          0x40024524 
#define GPIO_PORTE_AMSEL_R       0x40024528 
#define GPIO_PORTE_PCTL_R        0x4002452C 
#define GPIO_PORTE_ADCCTL_R      0x40024530 
#define GPIO_PORTE_DMACTL_R      0x40024534 

//*****************************************************************************
//
// GPIO registers (PORTF)
//
//*****************************************************************************
#define GPIO_PORTF_DATA_BITS_R   0x40025000)
#define GPIO_PORTF_DATA_R        0x400253FC 
#define GPIO_PORTF_DIR_R         0x40025400 
#define GPIO_PORTF_IS_R          0x40025404 
#define GPIO_PORTF_IBE_R         0x40025408 
#define GPIO_PORTF_IEV_R         0x4002540C 
#define GPIO_PORTF_IM_R          0x40025410 
#define GPIO_PORTF_RIS_R         0x40025414 
#define GPIO_PORTF_MIS_R         0x40025418 
#define GPIO_PORTF_ICR_R         0x4002541C 
#define GPIO_PORTF_AFSEL_R       0x40025420 
#define GPIO_PORTF_DR2R_R        0x40025500 
#define GPIO_PORTF_DR4R_R        0x40025504 
#define GPIO_PORTF_DR8R_R        0x40025508 
#define GPIO_PORTF_ODR_R         0x4002550C 
#define GPIO_PORTF_PUR_R         0x40025510 
#define GPIO_PORTF_PDR_R         0x40025514 
#define GPIO_PORTF_SLR_R         0x40025518 
#define GPIO_PORTF_DEN_R         0x4002551C 
#define GPIO_PORTF_LOCK_R        0x40025520 
#define GPIO_PORTF_CR_R          0x40025524 
#define GPIO_PORTF_AMSEL_R       0x40025528 
#define GPIO_PORTF_PCTL_R        0x4002552C 
#define GPIO_PORTF_ADCCTL_R      0x40025530 
#define GPIO_PORTF_DMACTL_R      0x40025534 

//*****************************************************************************
//
// PWM registers (PWM0)
//
//*****************************************************************************
#define PWM0_CTL_R               0x40028000 
#define PWM0_SYNC_R              0x40028004 
#define PWM0_ENABLE_R            0x40028008 
#define PWM0_INVERT_R            0x4002800C 
#define PWM0_FAULT_R             0x40028010 
#define PWM0_INTEN_R             0x40028014 
#define PWM0_RIS_R               0x40028018 
#define PWM0_ISC_R               0x4002801C 
#define PWM0_STATUS_R            0x40028020 
#define PWM0_FAULTVAL_R          0x40028024 
#define PWM0_ENUPD_R             0x40028028 
#define PWM0_0_CTL_R             0x40028040 
#define PWM0_0_INTEN_R           0x40028044 
#define PWM0_0_RIS_R             0x40028048 
#define PWM0_0_ISC_R             0x4002804C 
#define PWM0_0_LOAD_R            0x40028050 
#define PWM0_0_COUNT_R           0x40028054 
#define PWM0_0_CMPA_R            0x40028058 
#define PWM0_0_CMPB_R            0x4002805C 
#define PWM0_0_GENA_R            0x40028060 
#define PWM0_0_GENB_R            0x40028064 
#define PWM0_0_DBCTL_R           0x40028068 
#define PWM0_0_DBRISE_R          0x4002806C 
#define PWM0_0_DBFALL_R          0x40028070 
#define PWM0_0_FLTSRC0_R         0x40028074 
#define PWM0_0_FLTSRC1_R         0x40028078 
#define PWM0_0_MINFLTPER_R       0x4002807C 
#define PWM0_1_CTL_R             0x40028080 
#define PWM0_1_INTEN_R           0x40028084 
#define PWM0_1_RIS_R             0x40028088 
#define PWM0_1_ISC_R             0x4002808C 
#define PWM0_1_LOAD_R            0x40028090 
#define PWM0_1_COUNT_R           0x40028094 
#define PWM0_1_CMPA_R            0x40028098 
#define PWM0_1_CMPB_R            0x4002809C 
#define PWM0_1_GENA_R            0x400280A0 
#define PWM0_1_GENB_R            0x400280A4 
#define PWM0_1_DBCTL_R           0x400280A8 
#define PWM0_1_DBRISE_R          0x400280AC 
#define PWM0_1_DBFALL_R          0x400280B0 
#define PWM0_1_FLTSRC0_R         0x400280B4 
#define PWM0_1_FLTSRC1_R         0x400280B8 
#define PWM0_1_MINFLTPER_R       0x400280BC 
#define PWM0_2_CTL_R             0x400280C0 
#define PWM0_2_INTEN_R           0x400280C4 
#define PWM0_2_RIS_R             0x400280C8 
#define PWM0_2_ISC_R             0x400280CC 
#define PWM0_2_LOAD_R            0x400280D0 
#define PWM0_2_COUNT_R           0x400280D4 
#define PWM0_2_CMPA_R            0x400280D8 
#define PWM0_2_CMPB_R            0x400280DC 
#define PWM0_2_GENA_R            0x400280E0 
#define PWM0_2_GENB_R            0x400280E4 
#define PWM0_2_DBCTL_R           0x400280E8 
#define PWM0_2_DBRISE_R          0x400280EC 
#define PWM0_2_DBFALL_R          0x400280F0 
#define PWM0_2_FLTSRC0_R         0x400280F4 
#define PWM0_2_FLTSRC1_R         0x400280F8 
#define PWM0_2_MINFLTPER_R       0x400280FC 
#define PWM0_3_CTL_R             0x40028100 
#define PWM0_3_INTEN_R           0x40028104 
#define PWM0_3_RIS_R             0x40028108 
#define PWM0_3_ISC_R             0x4002810C 
#define PWM0_3_LOAD_R            0x40028110 
#define PWM0_3_COUNT_R           0x40028114 
#define PWM0_3_CMPA_R            0x40028118 
#define PWM0_3_CMPB_R            0x4002811C 
#define PWM0_3_GENA_R            0x40028120 
#define PWM0_3_GENB_R            0x40028124 
#define PWM0_3_DBCTL_R           0x40028128 
#define PWM0_3_DBRISE_R          0x4002812C 
#define PWM0_3_DBFALL_R          0x40028130 
#define PWM0_3_FLTSRC0_R         0x40028134 
#define PWM0_3_FLTSRC1_R         0x40028138 
#define PWM0_3_MINFLTPER_R       0x4002813C 
#define PWM0_0_FLTSEN_R          0x40028800 
#define PWM0_0_FLTSTAT0_R        0x40028804 
#define PWM0_0_FLTSTAT1_R        0x40028808 
#define PWM0_1_FLTSEN_R          0x40028880 
#define PWM0_1_FLTSTAT0_R        0x40028884 
#define PWM0_1_FLTSTAT1_R        0x40028888 
#define PWM0_2_FLTSTAT0_R        0x40028904 
#define PWM0_2_FLTSTAT1_R        0x40028908 
#define PWM0_3_FLTSTAT0_R        0x40028984 
#define PWM0_3_FLTSTAT1_R        0x40028988 
#define PWM0_PP_R                0x40028FC0 

//*****************************************************************************
//
// PWM registers (PWM1)
//
//*****************************************************************************
#define PWM1_CTL_R               0x40029000 
#define PWM1_SYNC_R              0x40029004 
#define PWM1_ENABLE_R            0x40029008 
#define PWM1_INVERT_R            0x4002900C 
#define PWM1_FAULT_R             0x40029010 
#define PWM1_INTEN_R             0x40029014 
#define PWM1_RIS_R               0x40029018 
#define PWM1_ISC_R               0x4002901C 
#define PWM1_STATUS_R            0x40029020 
#define PWM1_FAULTVAL_R          0x40029024 
#define PWM1_ENUPD_R             0x40029028 
#define PWM1_0_CTL_R             0x40029040 
#define PWM1_0_INTEN_R           0x40029044 
#define PWM1_0_RIS_R             0x40029048 
#define PWM1_0_ISC_R             0x4002904C 
#define PWM1_0_LOAD_R            0x40029050 
#define PWM1_0_COUNT_R           0x40029054 
#define PWM1_0_CMPA_R            0x40029058 
#define PWM1_0_CMPB_R            0x4002905C 
#define PWM1_0_GENA_R            0x40029060 
#define PWM1_0_GENB_R            0x40029064 
#define PWM1_0_DBCTL_R           0x40029068 
#define PWM1_0_DBRISE_R          0x4002906C 
#define PWM1_0_DBFALL_R          0x40029070 
#define PWM1_0_FLTSRC0_R         0x40029074 
#define PWM1_0_FLTSRC1_R         0x40029078 
#define PWM1_0_MINFLTPER_R       0x4002907C 
#define PWM1_1_CTL_R             0x40029080 
#define PWM1_1_INTEN_R           0x40029084 
#define PWM1_1_RIS_R             0x40029088 
#define PWM1_1_ISC_R             0x4002908C 
#define PWM1_1_LOAD_R            0x40029090 
#define PWM1_1_COUNT_R           0x40029094 
#define PWM1_1_CMPA_R            0x40029098 
#define PWM1_1_CMPB_R            0x4002909C 
#define PWM1_1_GENA_R            0x400290A0 
#define PWM1_1_GENB_R            0x400290A4 
#define PWM1_1_DBCTL_R           0x400290A8 
#define PWM1_1_DBRISE_R          0x400290AC 
#define PWM1_1_DBFALL_R          0x400290B0 
#define PWM1_1_FLTSRC0_R         0x400290B4 
#define PWM1_1_FLTSRC1_R         0x400290B8 
#define PWM1_1_MINFLTPER_R       0x400290BC 
#define PWM1_2_CTL_R             0x400290C0 
#define PWM1_2_INTEN_R           0x400290C4 
#define PWM1_2_RIS_R             0x400290C8 
#define PWM1_2_ISC_R             0x400290CC 
#define PWM1_2_LOAD_R            0x400290D0 
#define PWM1_2_COUNT_R           0x400290D4 
#define PWM1_2_CMPA_R            0x400290D8 
#define PWM1_2_CMPB_R            0x400290DC 
#define PWM1_2_GENA_R            0x400290E0 
#define PWM1_2_GENB_R            0x400290E4 
#define PWM1_2_DBCTL_R           0x400290E8 
#define PWM1_2_DBRISE_R          0x400290EC 
#define PWM1_2_DBFALL_R          0x400290F0 
#define PWM1_2_FLTSRC0_R         0x400290F4 
#define PWM1_2_FLTSRC1_R         0x400290F8 
#define PWM1_2_MINFLTPER_R       0x400290FC 
#define PWM1_3_CTL_R             0x40029100 
#define PWM1_3_INTEN_R           0x40029104 
#define PWM1_3_RIS_R             0x40029108 
#define PWM1_3_ISC_R             0x4002910C 
#define PWM1_3_LOAD_R            0x40029110 
#define PWM1_3_COUNT_R           0x40029114 
#define PWM1_3_CMPA_R            0x40029118 
#define PWM1_3_CMPB_R            0x4002911C 
#define PWM1_3_GENA_R            0x40029120 
#define PWM1_3_GENB_R            0x40029124 
#define PWM1_3_DBCTL_R           0x40029128 
#define PWM1_3_DBRISE_R          0x4002912C 
#define PWM1_3_DBFALL_R          0x40029130 
#define PWM1_3_FLTSRC0_R         0x40029134 
#define PWM1_3_FLTSRC1_R         0x40029138 
#define PWM1_3_MINFLTPER_R       0x4002913C 
#define PWM1_0_FLTSEN_R          0x40029800 
#define PWM1_0_FLTSTAT0_R        0x40029804 
#define PWM1_0_FLTSTAT1_R        0x40029808 
#define PWM1_1_FLTSEN_R          0x40029880 
#define PWM1_1_FLTSTAT0_R        0x40029884 
#define PWM1_1_FLTSTAT1_R        0x40029888 
#define PWM1_2_FLTSTAT0_R        0x40029904 
#define PWM1_2_FLTSTAT1_R        0x40029908 
#define PWM1_3_FLTSTAT0_R        0x40029984 
#define PWM1_3_FLTSTAT1_R        0x40029988 
#define PWM1_PP_R                0x40029FC0 

//*****************************************************************************
//
// QEI registers (QEI0)
//
//*****************************************************************************
#define QEI0_CTL_R               0x4002C000 
#define QEI0_STAT_R              0x4002C004 
#define QEI0_POS_R               0x4002C008 
#define QEI0_MAXPOS_R            0x4002C00C 
#define QEI0_LOAD_R              0x4002C010 
#define QEI0_TIME_R              0x4002C014 
#define QEI0_COUNT_R             0x4002C018 
#define QEI0_SPEED_R             0x4002C01C 
#define QEI0_INTEN_R             0x4002C020 
#define QEI0_RIS_R               0x4002C024 
#define QEI0_ISC_R               0x4002C028 

//*****************************************************************************
//
// QEI registers (QEI1)
//
//*****************************************************************************
#define QEI1_CTL_R               0x4002D000 
#define QEI1_STAT_R              0x4002D004 
#define QEI1_POS_R               0x4002D008 
#define QEI1_MAXPOS_R            0x4002D00C 
#define QEI1_LOAD_R              0x4002D010 
#define QEI1_TIME_R              0x4002D014 
#define QEI1_COUNT_R             0x4002D018 
#define QEI1_SPEED_R             0x4002D01C 
#define QEI1_INTEN_R             0x4002D020 
#define QEI1_RIS_R               0x4002D024 
#define QEI1_ISC_R               0x4002D028 

//*****************************************************************************
//
// Timer registers (TIMER0)
//
//*****************************************************************************
#define TIMER0_CFG_R             0x40030000 
#define TIMER0_TAMR_R            0x40030004 
#define TIMER0_TBMR_R            0x40030008 
#define TIMER0_CTL_R             0x4003000C 
#define TIMER0_SYNC_R            0x40030010 
#define TIMER0_IMR_R             0x40030018 
#define TIMER0_RIS_R             0x4003001C 
#define TIMER0_MIS_R             0x40030020 
#define TIMER0_ICR_R             0x40030024 
#define TIMER0_TAILR_R           0x40030028 
#define TIMER0_TBILR_R           0x4003002C 
#define TIMER0_TAMATCHR_R        0x40030030 
#define TIMER0_TBMATCHR_R        0x40030034 
#define TIMER0_TAPR_R            0x40030038 
#define TIMER0_TBPR_R            0x4003003C 
#define TIMER0_TAPMR_R           0x40030040 
#define TIMER0_TBPMR_R           0x40030044 
#define TIMER0_TAR_R             0x40030048 
#define TIMER0_TBR_R             0x4003004C 
#define TIMER0_TAV_R             0x40030050 
#define TIMER0_TBV_R             0x40030054 
#define TIMER0_RTCPD_R           0x40030058 
#define TIMER0_TAPS_R            0x4003005C 
#define TIMER0_TBPS_R            0x40030060 
#define TIMER0_TAPV_R            0x40030064 
#define TIMER0_TBPV_R            0x40030068 
#define TIMER0_PP_R              0x40030FC0 

//*****************************************************************************
//
// Timer registers (TIMER1)
//
//*****************************************************************************
#define TIMER1_CFG_R             0x40031000 
#define TIMER1_TAMR_R            0x40031004 
#define TIMER1_TBMR_R            0x40031008 
#define TIMER1_CTL_R             0x4003100C 
#define TIMER1_SYNC_R            0x40031010 
#define TIMER1_IMR_R             0x40031018 
#define TIMER1_RIS_R             0x4003101C 
#define TIMER1_MIS_R             0x40031020 
#define TIMER1_ICR_R             0x40031024 
#define TIMER1_TAILR_R           0x40031028 
#define TIMER1_TBILR_R           0x4003102C 
#define TIMER1_TAMATCHR_R        0x40031030 
#define TIMER1_TBMATCHR_R        0x40031034 
#define TIMER1_TAPR_R            0x40031038 
#define TIMER1_TBPR_R            0x4003103C 
#define TIMER1_TAPMR_R           0x40031040 
#define TIMER1_TBPMR_R           0x40031044 
#define TIMER1_TAR_R             0x40031048 
#define TIMER1_TBR_R             0x4003104C 
#define TIMER1_TAV_R             0x40031050 
#define TIMER1_TBV_R             0x40031054 
#define TIMER1_RTCPD_R           0x40031058 
#define TIMER1_TAPS_R            0x4003105C 
#define TIMER1_TBPS_R            0x40031060 
#define TIMER1_TAPV_R            0x40031064 
#define TIMER1_TBPV_R            0x40031068 
#define TIMER1_PP_R              0x40031FC0 

//*****************************************************************************
//
// Timer registers (TIMER2)
//
//*****************************************************************************
#define TIMER2_CFG_R             0x40032000 
#define TIMER2_TAMR_R            0x40032004 
#define TIMER2_TBMR_R            0x40032008 
#define TIMER2_CTL_R             0x4003200C 
#define TIMER2_SYNC_R            0x40032010 
#define TIMER2_IMR_R             0x40032018 
#define TIMER2_RIS_R             0x4003201C 
#define TIMER2_MIS_R             0x40032020 
#define TIMER2_ICR_R             0x40032024 
#define TIMER2_TAILR_R           0x40032028 
#define TIMER2_TBILR_R           0x4003202C 
#define TIMER2_TAMATCHR_R        0x40032030 
#define TIMER2_TBMATCHR_R        0x40032034 
#define TIMER2_TAPR_R            0x40032038 
#define TIMER2_TBPR_R            0x4003203C 
#define TIMER2_TAPMR_R           0x40032040 
#define TIMER2_TBPMR_R           0x40032044 
#define TIMER2_TAR_R             0x40032048 
#define TIMER2_TBR_R             0x4003204C 
#define TIMER2_TAV_R             0x40032050 
#define TIMER2_TBV_R             0x40032054 
#define TIMER2_RTCPD_R           0x40032058 
#define TIMER2_TAPS_R            0x4003205C 
#define TIMER2_TBPS_R            0x40032060 
#define TIMER2_TAPV_R            0x40032064 
#define TIMER2_TBPV_R            0x40032068 
#define TIMER2_PP_R              0x40032FC0 

//*****************************************************************************
//
// Timer registers (TIMER3)
//
//*****************************************************************************
#define TIMER3_CFG_R             0x40033000 
#define TIMER3_TAMR_R            0x40033004 
#define TIMER3_TBMR_R            0x40033008 
#define TIMER3_CTL_R             0x4003300C 
#define TIMER3_SYNC_R            0x40033010 
#define TIMER3_IMR_R             0x40033018 
#define TIMER3_RIS_R             0x4003301C 
#define TIMER3_MIS_R             0x40033020 
#define TIMER3_ICR_R             0x40033024 
#define TIMER3_TAILR_R           0x40033028 
#define TIMER3_TBILR_R           0x4003302C 
#define TIMER3_TAMATCHR_R        0x40033030 
#define TIMER3_TBMATCHR_R        0x40033034 
#define TIMER3_TAPR_R            0x40033038 
#define TIMER3_TBPR_R            0x4003303C 
#define TIMER3_TAPMR_R           0x40033040 
#define TIMER3_TBPMR_R           0x40033044 
#define TIMER3_TAR_R             0x40033048 
#define TIMER3_TBR_R             0x4003304C 
#define TIMER3_TAV_R             0x40033050 
#define TIMER3_TBV_R             0x40033054 
#define TIMER3_RTCPD_R           0x40033058 
#define TIMER3_TAPS_R            0x4003305C 
#define TIMER3_TBPS_R            0x40033060 
#define TIMER3_TAPV_R            0x40033064 
#define TIMER3_TBPV_R            0x40033068 
#define TIMER3_PP_R              0x40033FC0 

