Komidass/Hotel_Room/tm4c123gh6pm_modified.h
//*****************************************************************************
//
// Univeral Serial Bus registers (USB0)
//
//*****************************************************************************
#define USB0_FADDR_R             0x40050000 
#define USB0_POWER_R             0x40050001 
#define USB0_TXIS_R              0x40050002 
#define USB0_RXIS_R              0x40050004 
#define USB0_TXIE_R              0x40050006 
#define USB0_RXIE_R              0x40050008 
#define USB0_IS_R                0x4005000A 
#define USB0_IE_R                0x4005000B 
#define USB0_FRAME_R             0x4005000C 
#define USB0_EPIDX_R             0x4005000E 
#define USB0_TEST_R              0x4005000F 
#define USB0_FIFO0_R             0x40050020 
#define USB0_FIFO1_R             0x40050024 
#define USB0_FIFO2_R             0x40050028 
#define USB0_FIFO3_R             0x4005002C 
#define USB0_FIFO4_R             0x40050030 
#define USB0_FIFO5_R             0x40050034 
#define USB0_FIFO6_R             0x40050038 
#define USB0_FIFO7_R             0x4005003C 
#define USB0_DEVCTL_R            0x40050060 
#define USB0_TXFIFOSZ_R          0x40050062 
#define USB0_RXFIFOSZ_R          0x40050063 
#define USB0_TXFIFOADD_R         0x40050064 
#define USB0_RXFIFOADD_R         0x40050066 
#define USB0_CONTIM_R            0x4005007A 
#define USB0_VPLEN_R             0x4005007B 
#define USB0_FSEOF_R             0x4005007D 
#define USB0_LSEOF_R             0x4005007E 
#define USB0_TXFUNCADDR0_R       0x40050080 
#define USB0_TXHUBADDR0_R        0x40050082 
#define USB0_TXHUBPORT0_R        0x40050083 
#define USB0_TXFUNCADDR1_R       0x40050088 
#define USB0_TXHUBADDR1_R        0x4005008A 
#define USB0_TXHUBPORT1_R        0x4005008B 
#define USB0_RXFUNCADDR1_R       0x4005008C 
#define USB0_RXHUBADDR1_R        0x4005008E 
#define USB0_RXHUBPORT1_R        0x4005008F 
#define USB0_TXFUNCADDR2_R       0x40050090 
#define USB0_TXHUBADDR2_R        0x40050092 
#define USB0_TXHUBPORT2_R        0x40050093 
#define USB0_RXFUNCADDR2_R       0x40050094 
#define USB0_RXHUBADDR2_R        0x40050096 
#define USB0_RXHUBPORT2_R        0x40050097 
#define USB0_TXFUNCADDR3_R       0x40050098 
#define USB0_TXHUBADDR3_R        0x4005009A 
#define USB0_TXHUBPORT3_R        0x4005009B 
#define USB0_RXFUNCADDR3_R       0x4005009C 
#define USB0_RXHUBADDR3_R        0x4005009E 
#define USB0_RXHUBPORT3_R        0x4005009F 
#define USB0_TXFUNCADDR4_R       0x400500A0 
#define USB0_TXHUBADDR4_R        0x400500A2 
#define USB0_TXHUBPORT4_R        0x400500A3 
#define USB0_RXFUNCADDR4_R       0x400500A4 
#define USB0_RXHUBADDR4_R        0x400500A6 
#define USB0_RXHUBPORT4_R        0x400500A7 
#define USB0_TXFUNCADDR5_R       0x400500A8 
#define USB0_TXHUBADDR5_R        0x400500AA 
#define USB0_TXHUBPORT5_R        0x400500AB 
#define USB0_RXFUNCADDR5_R       0x400500AC 
#define USB0_RXHUBADDR5_R        0x400500AE 
#define USB0_RXHUBPORT5_R        0x400500AF 
#define USB0_TXFUNCADDR6_R       0x400500B0 
#define USB0_TXHUBADDR6_R        0x400500B2 
#define USB0_TXHUBPORT6_R        0x400500B3 
#define USB0_RXFUNCADDR6_R       0x400500B4 
#define USB0_RXHUBADDR6_R        0x400500B6 
#define USB0_RXHUBPORT6_R        0x400500B7 
#define USB0_TXFUNCADDR7_R       0x400500B8 
#define USB0_TXHUBADDR7_R        0x400500BA 
#define USB0_TXHUBPORT7_R        0x400500BB 
#define USB0_RXFUNCADDR7_R       0x400500BC 
#define USB0_RXHUBADDR7_R        0x400500BE 
#define USB0_RXHUBPORT7_R        0x400500BF 
#define USB0_CSRL0_R             0x40050102 
#define USB0_CSRH0_R             0x40050103 
#define USB0_COUNT0_R            0x40050108 
#define USB0_TYPE0_R             0x4005010A 
#define USB0_NAKLMT_R            0x4005010B 
#define USB0_TXMAXP1_R           0x40050110 
#define USB0_TXCSRL1_R           0x40050112 
#define USB0_TXCSRH1_R           0x40050113 
#define USB0_RXMAXP1_R           0x40050114 
#define USB0_RXCSRL1_R           0x40050116 
#define USB0_RXCSRH1_R           0x40050117 
#define USB0_RXCOUNT1_R          0x40050118 
#define USB0_TXTYPE1_R           0x4005011A 
#define USB0_TXINTERVAL1_R       0x4005011B 
#define USB0_RXTYPE1_R           0x4005011C 
#define USB0_RXINTERVAL1_R       0x4005011D 
#define USB0_TXMAXP2_R           0x40050120 
#define USB0_TXCSRL2_R           0x40050122 
#define USB0_TXCSRH2_R           0x40050123 
#define USB0_RXMAXP2_R           0x40050124 
#define USB0_RXCSRL2_R           0x40050126 
#define USB0_RXCSRH2_R           0x40050127 
#define USB0_RXCOUNT2_R          0x40050128 
#define USB0_TXTYPE2_R           0x4005012A 
#define USB0_TXINTERVAL2_R       0x4005012B 
#define USB0_RXTYPE2_R           0x4005012C 
#define USB0_RXINTERVAL2_R       0x4005012D 
#define USB0_TXMAXP3_R           0x40050130 
#define USB0_TXCSRL3_R           0x40050132 
#define USB0_TXCSRH3_R           0x40050133 
#define USB0_RXMAXP3_R           0x40050134 
#define USB0_RXCSRL3_R           0x40050136 
#define USB0_RXCSRH3_R           0x40050137 
#define USB0_RXCOUNT3_R          0x40050138 
#define USB0_TXTYPE3_R           0x4005013A 
#define USB0_TXINTERVAL3_R       0x4005013B 
#define USB0_RXTYPE3_R           0x4005013C 
#define USB0_RXINTERVAL3_R       0x4005013D 
#define USB0_TXMAXP4_R           0x40050140 
#define USB0_TXCSRL4_R           0x40050142 
#define USB0_TXCSRH4_R           0x40050143 
#define USB0_RXMAXP4_R           0x40050144 
#define USB0_RXCSRL4_R           0x40050146 
#define USB0_RXCSRH4_R           0x40050147 
#define USB0_RXCOUNT4_R          0x40050148 
#define USB0_TXTYPE4_R           0x4005014A 
#define USB0_TXINTERVAL4_R       0x4005014B 
#define USB0_RXTYPE4_R           0x4005014C 
#define USB0_RXINTERVAL4_R       0x4005014D 
#define USB0_TXMAXP5_R           0x40050150 
#define USB0_TXCSRL5_R           0x40050152 
#define USB0_TXCSRH5_R           0x40050153 
#define USB0_RXMAXP5_R           0x40050154 
#define USB0_RXCSRL5_R           0x40050156 
#define USB0_RXCSRH5_R           0x40050157 
#define USB0_RXCOUNT5_R          0x40050158 
#define USB0_TXTYPE5_R           0x4005015A 
#define USB0_TXINTERVAL5_R       0x4005015B 
#define USB0_RXTYPE5_R           0x4005015C 
#define USB0_RXINTERVAL5_R       0x4005015D 
#define USB0_TXMAXP6_R           0x40050160 
#define USB0_TXCSRL6_R           0x40050162 
#define USB0_TXCSRH6_R           0x40050163 
#define USB0_RXMAXP6_R           0x40050164 
#define USB0_RXCSRL6_R           0x40050166 
#define USB0_RXCSRH6_R           0x40050167 
#define USB0_RXCOUNT6_R          0x40050168 
#define USB0_TXTYPE6_R           0x4005016A 
#define USB0_TXINTERVAL6_R       0x4005016B 
#define USB0_RXTYPE6_R           0x4005016C 
#define USB0_RXINTERVAL6_R       0x4005016D 
#define USB0_TXMAXP7_R           0x40050170 
#define USB0_TXCSRL7_R           0x40050172 
#define USB0_TXCSRH7_R           0x40050173 
#define USB0_RXMAXP7_R           0x40050174 
#define USB0_RXCSRL7_R           0x40050176 
#define USB0_RXCSRH7_R           0x40050177 
#define USB0_RXCOUNT7_R          0x40050178 
#define USB0_TXTYPE7_R           0x4005017A 
#define USB0_TXINTERVAL7_R       0x4005017B 
#define USB0_RXTYPE7_R           0x4005017C 
#define USB0_RXINTERVAL7_R       0x4005017D 
#define USB0_RQPKTCOUNT1_R       0x40050304 
#define USB0_RQPKTCOUNT2_R       0x40050308 
#define USB0_RQPKTCOUNT3_R       0x4005030C 
#define USB0_RQPKTCOUNT4_R       0x40050310 
#define USB0_RQPKTCOUNT5_R       0x40050314 
#define USB0_RQPKTCOUNT6_R       0x40050318 
#define USB0_RQPKTCOUNT7_R       0x4005031C 
#define USB0_RXDPKTBUFDIS_R      0x40050340 
#define USB0_TXDPKTBUFDIS_R      0x40050342 
#define USB0_EPC_R               0x40050400 
#define USB0_EPCRIS_R            0x40050404 
#define USB0_EPCIM_R             0x40050408 
#define USB0_EPCISC_R            0x4005040C 
#define USB0_DRRIS_R             0x40050410 
#define USB0_DRIM_R              0x40050414 
#define USB0_DRISC_R             0x40050418 
#define USB0_GPCS_R              0x4005041C 
#define USB0_VDC_R               0x40050430 
#define USB0_VDCRIS_R            0x40050434 
#define USB0_VDCIM_R             0x40050438 
#define USB0_VDCISC_R            0x4005043C 
#define USB0_IDVRIS_R            0x40050444 
#define USB0_IDVIM_R             0x40050448 
#define USB0_IDVISC_R            0x4005044C 
#define USB0_DMASEL_R            0x40050450 
#define USB0_PP_R                0x40050FC0 

//*****************************************************************************
//
// GPIO registers (PORTA AHB)
//
//*****************************************************************************
#define GPIO_PORTA_AHB_DATA_BITS_R                                            \
                                 0x40058000
#define GPIO_PORTA_AHB_DATA_R    0x400583FC 
#define GPIO_PORTA_AHB_DIR_R     0x40058400 
#define GPIO_PORTA_AHB_IS_R      0x40058404 
#define GPIO_PORTA_AHB_IBE_R     0x40058408 
#define GPIO_PORTA_AHB_IEV_R     0x4005840C 
#define GPIO_PORTA_AHB_IM_R      0x40058410 
#define GPIO_PORTA_AHB_RIS_R     0x40058414 
#define GPIO_PORTA_AHB_MIS_R     0x40058418 
#define GPIO_PORTA_AHB_ICR_R     0x4005841C 
#define GPIO_PORTA_AHB_AFSEL_R   0x40058420 
#define GPIO_PORTA_AHB_DR2R_R    0x40058500 
#define GPIO_PORTA_AHB_DR4R_R    0x40058504 
#define GPIO_PORTA_AHB_DR8R_R    0x40058508 
#define GPIO_PORTA_AHB_ODR_R     0x4005850C 
#define GPIO_PORTA_AHB_PUR_R     0x40058510 
#define GPIO_PORTA_AHB_PDR_R     0x40058514 
#define GPIO_PORTA_AHB_SLR_R     0x40058518 
#define GPIO_PORTA_AHB_DEN_R     0x4005851C 
#define GPIO_PORTA_AHB_LOCK_R    0x40058520 
#define GPIO_PORTA_AHB_CR_R      0x40058524 
#define GPIO_PORTA_AHB_AMSEL_R   0x40058528 
#define GPIO_PORTA_AHB_PCTL_R    0x4005852C 
#define GPIO_PORTA_AHB_ADCCTL_R  0x40058530 
#define GPIO_PORTA_AHB_DMACTL_R  0x40058534 

//*****************************************************************************
//
// GPIO registers (PORTB AHB)
//
//*****************************************************************************
#define GPIO_PORTB_AHB_DATA_BITS_R                                            \
                                 0x40059000
#define GPIO_PORTB_AHB_DATA_R    0x400593FC 
#define GPIO_PORTB_AHB_DIR_R     0x40059400 
#define GPIO_PORTB_AHB_IS_R      0x40059404 
#define GPIO_PORTB_AHB_IBE_R     0x40059408 
#define GPIO_PORTB_AHB_IEV_R     0x4005940C 
#define GPIO_PORTB_AHB_IM_R      0x40059410 
#define GPIO_PORTB_AHB_RIS_R     0x40059414 
#define GPIO_PORTB_AHB_MIS_R     0x40059418 
#define GPIO_PORTB_AHB_ICR_R     0x4005941C 
#define GPIO_PORTB_AHB_AFSEL_R   0x40059420 
#define GPIO_PORTB_AHB_DR2R_R    0x40059500 
#define GPIO_PORTB_AHB_DR4R_R    0x40059504 
#define GPIO_PORTB_AHB_DR8R_R    0x40059508 
#define GPIO_PORTB_AHB_ODR_R     0x4005950C 
#define GPIO_PORTB_AHB_PUR_R     0x40059510 
#define GPIO_PORTB_AHB_PDR_R     0x40059514 
#define GPIO_PORTB_AHB_SLR_R     0x40059518 
#define GPIO_PORTB_AHB_DEN_R     0x4005951C 
#define GPIO_PORTB_AHB_LOCK_R    0x40059520 
#define GPIO_PORTB_AHB_CR_R      0x40059524 
#define GPIO_PORTB_AHB_AMSEL_R   0x40059528 
#define GPIO_PORTB_AHB_PCTL_R    0x4005952C 
#define GPIO_PORTB_AHB_ADCCTL_R  0x40059530 
#define GPIO_PORTB_AHB_DMACTL_R  0x40059534 

//*****************************************************************************
//
// GPIO registers (PORTC AHB)
//
//*****************************************************************************
#define GPIO_PORTC_AHB_DATA_BITS_R                                            \
                                 0x4005A000
#define GPIO_PORTC_AHB_DATA_R    0x4005A3FC 
#define GPIO_PORTC_AHB_DIR_R     0x4005A400 
#define GPIO_PORTC_AHB_IS_R      0x4005A404 
#define GPIO_PORTC_AHB_IBE_R     0x4005A408 
#define GPIO_PORTC_AHB_IEV_R     0x4005A40C 
#define GPIO_PORTC_AHB_IM_R      0x4005A410 
#define GPIO_PORTC_AHB_RIS_R     0x4005A414 
#define GPIO_PORTC_AHB_MIS_R     0x4005A418 
#define GPIO_PORTC_AHB_ICR_R     0x4005A41C 
#define GPIO_PORTC_AHB_AFSEL_R   0x4005A420 
#define GPIO_PORTC_AHB_DR2R_R    0x4005A500 
#define GPIO_PORTC_AHB_DR4R_R    0x4005A504 
#define GPIO_PORTC_AHB_DR8R_R    0x4005A508 
#define GPIO_PORTC_AHB_ODR_R     0x4005A50C 
#define GPIO_PORTC_AHB_PUR_R     0x4005A510 
#define GPIO_PORTC_AHB_PDR_R     0x4005A514 
#define GPIO_PORTC_AHB_SLR_R     0x4005A518 
#define GPIO_PORTC_AHB_DEN_R     0x4005A51C 
#define GPIO_PORTC_AHB_LOCK_R    0x4005A520 
#define GPIO_PORTC_AHB_CR_R      0x4005A524 
#define GPIO_PORTC_AHB_AMSEL_R   0x4005A528 
#define GPIO_PORTC_AHB_PCTL_R    0x4005A52C 
#define GPIO_PORTC_AHB_ADCCTL_R  0x4005A530 
#define GPIO_PORTC_AHB_DMACTL_R  0x4005A534 

//*****************************************************************************
//
// GPIO registers (PORTD AHB)
//
//*****************************************************************************
#define GPIO_PORTD_AHB_DATA_BITS_R                                            \
                                 0x4005B000
#define GPIO_PORTD_AHB_DATA_R    0x4005B3FC 
#define GPIO_PORTD_AHB_DIR_R     0x4005B400 
#define GPIO_PORTD_AHB_IS_R      0x4005B404 
#define GPIO_PORTD_AHB_IBE_R     0x4005B408 
#define GPIO_PORTD_AHB_IEV_R     0x4005B40C 
#define GPIO_PORTD_AHB_IM_R      0x4005B410 
#define GPIO_PORTD_AHB_RIS_R     0x4005B414 
#define GPIO_PORTD_AHB_MIS_R     0x4005B418 
#define GPIO_PORTD_AHB_ICR_R     0x4005B41C 
#define GPIO_PORTD_AHB_AFSEL_R   0x4005B420 
#define GPIO_PORTD_AHB_DR2R_R    0x4005B500 
#define GPIO_PORTD_AHB_DR4R_R    0x4005B504 
#define GPIO_PORTD_AHB_DR8R_R    0x4005B508 
#define GPIO_PORTD_AHB_ODR_R     0x4005B50C 
#define GPIO_PORTD_AHB_PUR_R     0x4005B510 
#define GPIO_PORTD_AHB_PDR_R     0x4005B514 
#define GPIO_PORTD_AHB_SLR_R     0x4005B518 
#define GPIO_PORTD_AHB_DEN_R     0x4005B51C 
#define GPIO_PORTD_AHB_LOCK_R    0x4005B520 
#define GPIO_PORTD_AHB_CR_R      0x4005B524 
#define GPIO_PORTD_AHB_AMSEL_R   0x4005B528 
#define GPIO_PORTD_AHB_PCTL_R    0x4005B52C 
#define GPIO_PORTD_AHB_ADCCTL_R  0x4005B530 
#define GPIO_PORTD_AHB_DMACTL_R  0x4005B534 

//*****************************************************************************
//
// GPIO registers (PORTE AHB)
//
//*****************************************************************************
#define GPIO_PORTE_AHB_DATA_BITS_R                                            \
                                 0x4005C000
#define GPIO_PORTE_AHB_DATA_R    0x4005C3FC 
#define GPIO_PORTE_AHB_DIR_R     0x4005C400 
#define GPIO_PORTE_AHB_IS_R      0x4005C404 
#define GPIO_PORTE_AHB_IBE_R     0x4005C408 
#define GPIO_PORTE_AHB_IEV_R     0x4005C40C 
#define GPIO_PORTE_AHB_IM_R      0x4005C410 
#define GPIO_PORTE_AHB_RIS_R     0x4005C414 
#define GPIO_PORTE_AHB_MIS_R     0x4005C418 
#define GPIO_PORTE_AHB_ICR_R     0x4005C41C 
#define GPIO_PORTE_AHB_AFSEL_R   0x4005C420 
#define GPIO_PORTE_AHB_DR2R_R    0x4005C500 
#define GPIO_PORTE_AHB_DR4R_R    0x4005C504 
#define GPIO_PORTE_AHB_DR8R_R    0x4005C508 
#define GPIO_PORTE_AHB_ODR_R     0x4005C50C 
#define GPIO_PORTE_AHB_PUR_R     0x4005C510 
#define GPIO_PORTE_AHB_PDR_R     0x4005C514 
#define GPIO_PORTE_AHB_SLR_R     0x4005C518 
#define GPIO_PORTE_AHB_DEN_R     0x4005C51C 
#define GPIO_PORTE_AHB_LOCK_R    0x4005C520 
#define GPIO_PORTE_AHB_CR_R      0x4005C524 
#define GPIO_PORTE_AHB_AMSEL_R   0x4005C528 
#define GPIO_PORTE_AHB_PCTL_R    0x4005C52C 
#define GPIO_PORTE_AHB_ADCCTL_R  0x4005C530 
#define GPIO_PORTE_AHB_DMACTL_R  0x4005C534 

//*****************************************************************************
//
// GPIO registers (PORTF AHB)
//
//*****************************************************************************
#define GPIO_PORTF_AHB_DATA_BITS_R                                            \
                                 0x4005D000
#define GPIO_PORTF_AHB_DATA_R    0x4005D3FC 
#define GPIO_PORTF_AHB_DIR_R     0x4005D400 
#define GPIO_PORTF_AHB_IS_R      0x4005D404 
#define GPIO_PORTF_AHB_IBE_R     0x4005D408 
#define GPIO_PORTF_AHB_IEV_R     0x4005D40C 
#define GPIO_PORTF_AHB_IM_R      0x4005D410 
#define GPIO_PORTF_AHB_RIS_R     0x4005D414 
#define GPIO_PORTF_AHB_MIS_R     0x4005D418 
#define GPIO_PORTF_AHB_ICR_R     0x4005D41C 
#define GPIO_PORTF_AHB_AFSEL_R   0x4005D420 
#define GPIO_PORTF_AHB_DR2R_R    0x4005D500 
#define GPIO_PORTF_AHB_DR4R_R    0x4005D504 
#define GPIO_PORTF_AHB_DR8R_R    0x4005D508 
#define GPIO_PORTF_AHB_ODR_R     0x4005D50C 
#define GPIO_PORTF_AHB_PUR_R     0x4005D510 
#define GPIO_PORTF_AHB_PDR_R     0x4005D514 
#define GPIO_PORTF_AHB_SLR_R     0x4005D518 
#define GPIO_PORTF_AHB_DEN_R     0x4005D51C 
#define GPIO_PORTF_AHB_LOCK_R    0x4005D520 
#define GPIO_PORTF_AHB_CR_R      0x4005D524 
#define GPIO_PORTF_AHB_AMSEL_R   0x4005D528 
#define GPIO_PORTF_AHB_PCTL_R    0x4005D52C 
#define GPIO_PORTF_AHB_ADCCTL_R  0x4005D530 
#define GPIO_PORTF_AHB_DMACTL_R  0x4005D534 

//*****************************************************************************
//
// EEPROM registers (EEPROM)
//
//*****************************************************************************
#define EEPROM_EESIZE_R          0x400AF000 
#define EEPROM_EEBLOCK_R         0x400AF004 
#define EEPROM_EEOFFSET_R        0x400AF008 
#define EEPROM_EERDWR_R          0x400AF010 
#define EEPROM_EERDWRINC_R       0x400AF014 
#define EEPROM_EEDONE_R          0x400AF018 
#define EEPROM_EESUPP_R          0x400AF01C 
#define EEPROM_EEUNLOCK_R        0x400AF020 
#define EEPROM_EEPROT_R          0x400AF030 
#define EEPROM_EEPASS0_R         0x400AF034 
#define EEPROM_EEPASS1_R         0x400AF038 
#define EEPROM_EEPASS2_R         0x400AF03C 
#define EEPROM_EEINT_R           0x400AF040 
#define EEPROM_EEHIDE_R          0x400AF050 
#define EEPROM_EEDBGME_R         0x400AF080 
#define EEPROM_PP_R              0x400AFFC0 

//*****************************************************************************
//
// System Exception Module registers (SYSEXC)
//
//*****************************************************************************
#define SYSEXC_RIS_R             0x400F9000 
#define SYSEXC_IM_R              0x400F9004 
#define SYSEXC_MIS_R             0x400F9008 
#define SYSEXC_IC_R              0x400F900C 

//*****************************************************************************
//
// Hibernation module registers (HIB)
//
//*****************************************************************************
#define HIB_RTCC_R               0x400FC000 
#define HIB_RTCM0_R              0x400FC004 
#define HIB_RTCLD_R              0x400FC00C 
#define HIB_CTL_R                0x400FC010 
#define HIB_IM_R                 0x400FC014 
#define HIB_RIS_R                0x400FC018 
#define HIB_MIS_R                0x400FC01C 
#define HIB_IC_R                 0x400FC020 
#define HIB_RTCT_R               0x400FC024 
#define HIB_RTCSS_R              0x400FC028 
#define HIB_DATA_R               0x400FC030 

//*****************************************************************************
//
// FLASH registers (FLASH CTRL)
//
//*****************************************************************************
#define FLASH_FMA_R              0x400FD000 
#define FLASH_FMD_R              0x400FD004 
#define FLASH_FMC_R              0x400FD008 
#define FLASH_FCRIS_R            0x400FD00C 
#define FLASH_FCIM_R             0x400FD010 
#define FLASH_FCMISC_R           0x400FD014 
#define FLASH_FMC2_R             0x400FD020 
#define FLASH_FWBVAL_R           0x400FD030 
#define FLASH_FWBN_R             0x400FD100 
#define FLASH_FSIZE_R            0x400FDFC0 
#define FLASH_SSIZE_R            0x400FDFC4 
#define FLASH_ROMSWMAP_R         0x400FDFCC 
#define FLASH_RMCTL_R            0x400FE0F0 
#define FLASH_BOOTCFG_R          0x400FE1D0 
#define FLASH_USERREG0_R         0x400FE1E0 
#define FLASH_USERREG1_R         0x400FE1E4 
#define FLASH_USERREG2_R         0x400FE1E8 
#define FLASH_USERREG3_R         0x400FE1EC 
#define FLASH_FMPRE0_R           0x400FE200 
#define FLASH_FMPRE1_R           0x400FE204 
#define FLASH_FMPRE2_R           0x400FE208 
#define FLASH_FMPRE3_R           0x400FE20C 
#define FLASH_FMPPE0_R           0x400FE400 
#define FLASH_FMPPE1_R           0x400FE404 
#define FLASH_FMPPE2_R           0x400FE408 
#define FLASH_FMPPE3_R           0x400FE40C 

