Komidass/Hotel_Room/tm4c123gh6pm_modified.h
//*****************************************************************************
//
// System Control registers (SYSCTL)
//
//*****************************************************************************
#define SYSCTL_DID0_R            0x400FE000 
#define SYSCTL_DID1_R            0x400FE004 
#define SYSCTL_DC0_R             0x400FE008 
#define SYSCTL_DC1_R             0x400FE010 
#define SYSCTL_DC2_R             0x400FE014 
#define SYSCTL_DC3_R             0x400FE018 
#define SYSCTL_DC4_R             0x400FE01C 
#define SYSCTL_DC5_R             0x400FE020 
#define SYSCTL_DC6_R             0x400FE024 
#define SYSCTL_DC7_R             0x400FE028 
#define SYSCTL_DC8_R             0x400FE02C 
#define SYSCTL_PBORCTL_R         0x400FE030 
#define SYSCTL_SRCR0_R           0x400FE040 
#define SYSCTL_SRCR1_R           0x400FE044 
#define SYSCTL_SRCR2_R           0x400FE048 
#define SYSCTL_RIS_R             0x400FE050 
#define SYSCTL_IMC_R             0x400FE054 
#define SYSCTL_MISC_R            0x400FE058 
#define SYSCTL_RESC_R            0x400FE05C 
#define SYSCTL_RCC_R             0x400FE060 
#define SYSCTL_GPIOHBCTL_R       0x400FE06C 
#define SYSCTL_RCC2_R            0x400FE070 
#define SYSCTL_MOSCCTL_R         0x400FE07C 
#define SYSCTL_RCGC0_R           0x400FE100 
#define SYSCTL_RCGC1_R           0x400FE104 
#define SYSCTL_RCGC2_R           0x400FE108 
#define SYSCTL_SCGC0_R           0x400FE110 
#define SYSCTL_SCGC1_R           0x400FE114 
#define SYSCTL_SCGC2_R           0x400FE118 
#define SYSCTL_DCGC0_R           0x400FE120 
#define SYSCTL_DCGC1_R           0x400FE124 
#define SYSCTL_DCGC2_R           0x400FE128 
#define SYSCTL_DSLPCLKCFG_R      0x400FE144 
#define SYSCTL_SYSPROP_R         0x400FE14C 
#define SYSCTL_PIOSCCAL_R        0x400FE150 
#define SYSCTL_PIOSCSTAT_R       0x400FE154 
#define SYSCTL_PLLFREQ0_R        0x400FE160 
#define SYSCTL_PLLFREQ1_R        0x400FE164 
#define SYSCTL_PLLSTAT_R         0x400FE168 
#define SYSCTL_SLPPWRCFG_R       0x400FE188 
#define SYSCTL_DSLPPWRCFG_R      0x400FE18C 
#define SYSCTL_DC9_R             0x400FE190 
#define SYSCTL_NVMSTAT_R         0x400FE1A0 
#define SYSCTL_LDOSPCTL_R        0x400FE1B4 
#define SYSCTL_LDODPCTL_R        0x400FE1BC 
#define SYSCTL_PPWD_R            0x400FE300 
#define SYSCTL_PPTIMER_R         0x400FE304 
#define SYSCTL_PPGPIO_R          0x400FE308 
#define SYSCTL_PPDMA_R           0x400FE30C 
#define SYSCTL_PPHIB_R           0x400FE314 
#define SYSCTL_PPUART_R          0x400FE318 
#define SYSCTL_PPSSI_R           0x400FE31C 
#define SYSCTL_PPI2C_R           0x400FE320 
#define SYSCTL_PPUSB_R           0x400FE328 
#define SYSCTL_PPCAN_R           0x400FE334 
#define SYSCTL_PPADC_R           0x400FE338 
#define SYSCTL_PPACMP_R          0x400FE33C 
#define SYSCTL_PPPWM_R           0x400FE340 
#define SYSCTL_PPQEI_R           0x400FE344 
#define SYSCTL_PPEEPROM_R        0x400FE358 
#define SYSCTL_PPWTIMER_R        0x400FE35C 
#define SYSCTL_SRWD_R            0x400FE500 
#define SYSCTL_SRTIMER_R         0x400FE504 
#define SYSCTL_SRGPIO_R          0x400FE508 
#define SYSCTL_SRDMA_R           0x400FE50C 
#define SYSCTL_SRHIB_R           0x400FE514 
#define SYSCTL_SRUART_R          0x400FE518 
#define SYSCTL_SRSSI_R           0x400FE51C 
#define SYSCTL_SRI2C_R           0x400FE520 
#define SYSCTL_SRUSB_R           0x400FE528 
#define SYSCTL_SRCAN_R           0x400FE534 
#define SYSCTL_SRADC_R           0x400FE538 
#define SYSCTL_SRACMP_R          0x400FE53C 
#define SYSCTL_SRPWM_R           0x400FE540 
#define SYSCTL_SRQEI_R           0x400FE544 
#define SYSCTL_SREEPROM_R        0x400FE558 
#define SYSCTL_SRWTIMER_R        0x400FE55C 
#define SYSCTL_RCGCWD_R          0x400FE600 
#define SYSCTL_RCGCTIMER_R       0x400FE604 
#define SYSCTL_RCGCGPIO_R        0x400FE608 
#define SYSCTL_RCGCDMA_R         0x400FE60C 
#define SYSCTL_RCGCHIB_R         0x400FE614 
#define SYSCTL_RCGCUART_R        0x400FE618 
#define SYSCTL_RCGCSSI_R         0x400FE61C 
#define SYSCTL_RCGCI2C_R         0x400FE620 
#define SYSCTL_RCGCUSB_R         0x400FE628 
#define SYSCTL_RCGCCAN_R         0x400FE634 
#define SYSCTL_RCGCADC_R         0x400FE638 
#define SYSCTL_RCGCACMP_R        0x400FE63C 
#define SYSCTL_RCGCPWM_R         0x400FE640 
#define SYSCTL_RCGCQEI_R         0x400FE644 
#define SYSCTL_RCGCEEPROM_R      0x400FE658 
#define SYSCTL_RCGCWTIMER_R      0x400FE65C 
#define SYSCTL_SCGCWD_R          0x400FE700 
#define SYSCTL_SCGCTIMER_R       0x400FE704 
#define SYSCTL_SCGCGPIO_R        0x400FE708 
#define SYSCTL_SCGCDMA_R         0x400FE70C 
#define SYSCTL_SCGCHIB_R         0x400FE714 
#define SYSCTL_SCGCUART_R        0x400FE718 
#define SYSCTL_SCGCSSI_R         0x400FE71C 
#define SYSCTL_SCGCI2C_R         0x400FE720 
#define SYSCTL_SCGCUSB_R         0x400FE728 
#define SYSCTL_SCGCCAN_R         0x400FE734 
#define SYSCTL_SCGCADC_R         0x400FE738 
#define SYSCTL_SCGCACMP_R        0x400FE73C 
#define SYSCTL_SCGCPWM_R         0x400FE740 
#define SYSCTL_SCGCQEI_R         0x400FE744 
#define SYSCTL_SCGCEEPROM_R      0x400FE758 
#define SYSCTL_SCGCWTIMER_R      0x400FE75C 
#define SYSCTL_DCGCWD_R          0x400FE800 
#define SYSCTL_DCGCTIMER_R       0x400FE804 
#define SYSCTL_DCGCGPIO_R        0x400FE808 
#define SYSCTL_DCGCDMA_R         0x400FE80C 
#define SYSCTL_DCGCHIB_R         0x400FE814 
#define SYSCTL_DCGCUART_R        0x400FE818 
#define SYSCTL_DCGCSSI_R         0x400FE81C 
#define SYSCTL_DCGCI2C_R         0x400FE820 
#define SYSCTL_DCGCUSB_R         0x400FE828 
#define SYSCTL_DCGCCAN_R         0x400FE834 
#define SYSCTL_DCGCADC_R         0x400FE838 
#define SYSCTL_DCGCACMP_R        0x400FE83C 
#define SYSCTL_DCGCPWM_R         0x400FE840 
#define SYSCTL_DCGCQEI_R         0x400FE844 
#define SYSCTL_DCGCEEPROM_R      0x400FE858 
#define SYSCTL_DCGCWTIMER_R      0x400FE85C 
#define SYSCTL_PRWD_R            0x400FEA00 
#define SYSCTL_PRTIMER_R         0x400FEA04 
#define SYSCTL_PRGPIO_R          0x400FEA08 
#define SYSCTL_PRDMA_R           0x400FEA0C 
#define SYSCTL_PRHIB_R           0x400FEA14 
#define SYSCTL_PRUART_R          0x400FEA18 
#define SYSCTL_PRSSI_R           0x400FEA1C 
#define SYSCTL_PRI2C_R           0x400FEA20 
#define SYSCTL_PRUSB_R           0x400FEA28 
#define SYSCTL_PRCAN_R           0x400FEA34 
#define SYSCTL_PRADC_R           0x400FEA38 
#define SYSCTL_PRACMP_R          0x400FEA3C 
#define SYSCTL_PRPWM_R           0x400FEA40 
#define SYSCTL_PRQEI_R           0x400FEA44 
#define SYSCTL_PREEPROM_R        0x400FEA58 
#define SYSCTL_PRWTIMER_R        0x400FEA5C 

//*****************************************************************************
//
// Micro Direct Memory Access registers (UDMA)
//
//*****************************************************************************
#define UDMA_STAT_R              0x400FF000 
#define UDMA_CFG_R               0x400FF004 
#define UDMA_CTLBASE_R           0x400FF008 
#define UDMA_ALTBASE_R           0x400FF00C 
#define UDMA_WAITSTAT_R          0x400FF010 
#define UDMA_SWREQ_R             0x400FF014 
#define UDMA_USEBURSTSET_R       0x400FF018 
#define UDMA_USEBURSTCLR_R       0x400FF01C 
#define UDMA_REQMASKSET_R        0x400FF020 
#define UDMA_REQMASKCLR_R        0x400FF024 
#define UDMA_ENASET_R            0x400FF028 
#define UDMA_ENACLR_R            0x400FF02C 
#define UDMA_ALTSET_R            0x400FF030 
#define UDMA_ALTCLR_R            0x400FF034 
#define UDMA_PRIOSET_R           0x400FF038 
#define UDMA_PRIOCLR_R           0x400FF03C 
#define UDMA_ERRCLR_R            0x400FF04C 
#define UDMA_CHASGN_R            0x400FF500 
#define UDMA_CHIS_R              0x400FF504 
#define UDMA_CHMAP0_R            0x400FF510 
#define UDMA_CHMAP1_R            0x400FF514 
#define UDMA_CHMAP2_R            0x400FF518 
#define UDMA_CHMAP3_R            0x400FF51C 

//*****************************************************************************
//
// Micro Direct Memory Access (uDMA) offsets (UDMA)
//
//*****************************************************************************
#define UDMA_SRCENDP            0x00000000  // DMA Channel Source Address End
                                            // Pointer
#define UDMA_DSTENDP            0x00000004  // DMA Channel Destination Address
                                            // End Pointer
#define UDMA_CHCTL              0x00000008  // DMA Channel Control Word

//*****************************************************************************
//
// NVIC registers (NVIC)
//
//*****************************************************************************
#define NVIC_ACTLR_R             0xE000E008 
#define NVIC_ST_CTRL_R           0xE000E010 
#define NVIC_ST_RELOAD_R         0xE000E014 
#define NVIC_ST_CURRENT_R        0xE000E018 
#define NVIC_EN0_R               0xE000E100 
#define NVIC_EN1_R               0xE000E104 
#define NVIC_EN2_R               0xE000E108 
#define NVIC_EN3_R               0xE000E10C 
#define NVIC_EN4_R               0xE000E110 
#define NVIC_DIS0_R              0xE000E180 
#define NVIC_DIS1_R              0xE000E184 
#define NVIC_DIS2_R              0xE000E188 
#define NVIC_DIS3_R              0xE000E18C 
#define NVIC_DIS4_R              0xE000E190 
#define NVIC_PEND0_R             0xE000E200 
#define NVIC_PEND1_R             0xE000E204 
#define NVIC_PEND2_R             0xE000E208 
#define NVIC_PEND3_R             0xE000E20C 
#define NVIC_PEND4_R             0xE000E210 
#define NVIC_UNPEND0_R           0xE000E280 
#define NVIC_UNPEND1_R           0xE000E284 
#define NVIC_UNPEND2_R           0xE000E288 
#define NVIC_UNPEND3_R           0xE000E28C 
#define NVIC_UNPEND4_R           0xE000E290 
#define NVIC_ACTIVE0_R           0xE000E300 
#define NVIC_ACTIVE1_R           0xE000E304 
#define NVIC_ACTIVE2_R           0xE000E308 
#define NVIC_ACTIVE3_R           0xE000E30C 
#define NVIC_ACTIVE4_R           0xE000E310 
#define NVIC_PRI0_R              0xE000E400 
#define NVIC_PRI1_R              0xE000E404 
#define NVIC_PRI2_R              0xE000E408 
#define NVIC_PRI3_R              0xE000E40C 
#define NVIC_PRI4_R              0xE000E410 
#define NVIC_PRI5_R              0xE000E414 
#define NVIC_PRI6_R              0xE000E418 
#define NVIC_PRI7_R              0xE000E41C 
#define NVIC_PRI8_R              0xE000E420 
#define NVIC_PRI9_R              0xE000E424 
#define NVIC_PRI10_R             0xE000E428 
#define NVIC_PRI11_R             0xE000E42C 
#define NVIC_PRI12_R             0xE000E430 
#define NVIC_PRI13_R             0xE000E434 
#define NVIC_PRI14_R             0xE000E438 
#define NVIC_PRI15_R             0xE000E43C 
#define NVIC_PRI16_R             0xE000E440 
#define NVIC_PRI17_R             0xE000E444 
#define NVIC_PRI18_R             0xE000E448 
#define NVIC_PRI19_R             0xE000E44C 
#define NVIC_PRI20_R             0xE000E450 
#define NVIC_PRI21_R             0xE000E454 
#define NVIC_PRI22_R             0xE000E458 
#define NVIC_PRI23_R             0xE000E45C 
#define NVIC_PRI24_R             0xE000E460 
#define NVIC_PRI25_R             0xE000E464 
#define NVIC_PRI26_R             0xE000E468 
#define NVIC_PRI27_R             0xE000E46C 
#define NVIC_PRI28_R             0xE000E470 
#define NVIC_PRI29_R             0xE000E474 
#define NVIC_PRI30_R             0xE000E478 
#define NVIC_PRI31_R             0xE000E47C 
#define NVIC_PRI32_R             0xE000E480 
#define NVIC_PRI33_R             0xE000E484 
#define NVIC_PRI34_R             0xE000E488 
#define NVIC_CPUID_R             0xE000ED00 
#define NVIC_INT_CTRL_R          0xE000ED04 
#define NVIC_VTABLE_R            0xE000ED08 
#define NVIC_APINT_R             0xE000ED0C 
#define NVIC_SYS_CTRL_R          0xE000ED10 
#define NVIC_CFG_CTRL_R          0xE000ED14 
#define NVIC_SYS_PRI1_R          0xE000ED18 
#define NVIC_SYS_PRI2_R          0xE000ED1C 
#define NVIC_SYS_PRI3_R          0xE000ED20 
#define NVIC_SYS_HND_CTRL_R      0xE000ED24 
#define NVIC_FAULT_STAT_R        0xE000ED28 
#define NVIC_HFAULT_STAT_R       0xE000ED2C 
#define NVIC_DEBUG_STAT_R        0xE000ED30 
#define NVIC_MM_ADDR_R           0xE000ED34 
#define NVIC_FAULT_ADDR_R        0xE000ED38 
#define NVIC_CPAC_R              0xE000ED88 
#define NVIC_MPU_TYPE_R          0xE000ED90 
#define NVIC_MPU_CTRL_R          0xE000ED94 
#define NVIC_MPU_NUMBER_R        0xE000ED98 
#define NVIC_MPU_BASE_R          0xE000ED9C 
#define NVIC_MPU_ATTR_R          0xE000EDA0 
#define NVIC_MPU_BASE1_R         0xE000EDA4 
#define NVIC_MPU_ATTR1_R         0xE000EDA8 
#define NVIC_MPU_BASE2_R         0xE000EDAC 
#define NVIC_MPU_ATTR2_R         0xE000EDB0 
#define NVIC_MPU_BASE3_R         0xE000EDB4 
#define NVIC_MPU_ATTR3_R         0xE000EDB8 
#define NVIC_DBG_CTRL_R          0xE000EDF0 
#define NVIC_DBG_XFER_R          0xE000EDF4 
#define NVIC_DBG_DATA_R          0xE000EDF8 
#define NVIC_DBG_INT_R           0xE000EDFC 
#define NVIC_SW_TRIG_R           0xE000EF00 
#define NVIC_FPCC_R              0xE000EF34 
#define NVIC_FPCA_R              0xE000EF38 
#define NVIC_FPDSC_R             0xE000EF3C 

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_LOAD register.
//
//*****************************************************************************
#define WDT_LOAD_M              0xFFFFFFFF  // Watchdog Load Value
#define WDT_LOAD_S              0

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_VALUE register.
//
//*****************************************************************************
#define WDT_VALUE_M             0xFFFFFFFF  // Watchdog Value
#define WDT_VALUE_S             0

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_CTL register.
//
//*****************************************************************************
#define WDT_CTL_WRC             0x80000000  // Write Complete
#define WDT_CTL_INTTYPE         0x00000004  // Watchdog Interrupt Type
#define WDT_CTL_RESEN           0x00000002  // Watchdog Reset Enable
#define WDT_CTL_INTEN           0x00000001  // Watchdog Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_ICR register.
//
//*****************************************************************************
#define WDT_ICR_M               0xFFFFFFFF  // Watchdog Interrupt Clear
#define WDT_ICR_S               0

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_RIS register.
//
//*****************************************************************************
#define WDT_RIS_WDTRIS          0x00000001  // Watchdog Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_MIS register.
//
//*****************************************************************************
#define WDT_MIS_WDTMIS          0x00000001  // Watchdog Masked Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_TEST register.
//
//*****************************************************************************
#define WDT_TEST_STALL          0x00000100  // Watchdog Stall Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the WDT_O_LOCK register.
//
//*****************************************************************************
#define WDT_LOCK_M              0xFFFFFFFF  // Watchdog Lock
#define WDT_LOCK_UNLOCKED       0x00000000  // Unlocked
#define WDT_LOCK_LOCKED         0x00000001  // Locked
#define WDT_LOCK_UNLOCK         0x1ACCE551  // Unlocks the watchdog timer

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_IM register.
//
//*****************************************************************************
#define GPIO_IM_GPIO_M          0x000000FF  // GPIO Interrupt Mask Enable
#define GPIO_IM_GPIO_S          0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_RIS register.
//
//*****************************************************************************
#define GPIO_RIS_GPIO_M         0x000000FF  // GPIO Interrupt Raw Status
#define GPIO_RIS_GPIO_S         0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_MIS register.
//
//*****************************************************************************
#define GPIO_MIS_GPIO_M         0x000000FF  // GPIO Masked Interrupt Status
#define GPIO_MIS_GPIO_S         0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_ICR register.
//
//*****************************************************************************
#define GPIO_ICR_GPIO_M         0x000000FF  // GPIO Interrupt Clear
#define GPIO_ICR_GPIO_S         0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_O_LOCK register.
//
//*****************************************************************************
#define GPIO_LOCK_M             0xFFFFFFFF  // GPIO Lock
#define GPIO_LOCK_UNLOCKED      0x00000000  // The GPIOCR register is unlocked
                                            // and may be modified
#define GPIO_LOCK_LOCKED        0x00000001  // The GPIOCR register is locked
                                            // and may not be modified
#define GPIO_LOCK_KEY           0x4C4F434B  // Unlocks the GPIO_CR register

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port A.
//
//*****************************************************************************
#define GPIO_PCTL_PA7_M         0xF0000000  // PA7 Mask
#define GPIO_PCTL_PA7_I2C1SDA   0x30000000  // I2C1SDA on PA7
#define GPIO_PCTL_PA7_M1PWM3    0x50000000  // M1PWM3 on PA7
#define GPIO_PCTL_PA6_M         0x0F000000  // PA6 Mask
#define GPIO_PCTL_PA6_I2C1SCL   0x03000000  // I2C1SCL on PA6
#define GPIO_PCTL_PA6_M1PWM2    0x05000000  // M1PWM2 on PA6
#define GPIO_PCTL_PA5_M         0x00F00000  // PA5 Mask
#define GPIO_PCTL_PA5_SSI0TX    0x00200000  // SSI0TX on PA5
#define GPIO_PCTL_PA4_M         0x000F0000  // PA4 Mask
#define GPIO_PCTL_PA4_SSI0RX    0x00020000  // SSI0RX on PA4
#define GPIO_PCTL_PA3_M         0x0000F000  // PA3 Mask
#define GPIO_PCTL_PA3_SSI0FSS   0x00002000  // SSI0FSS on PA3
#define GPIO_PCTL_PA2_M         0x00000F00  // PA2 Mask
#define GPIO_PCTL_PA2_SSI0CLK   0x00000200  // SSI0CLK on PA2
#define GPIO_PCTL_PA1_M         0x000000F0  // PA1 Mask
#define GPIO_PCTL_PA1_U0TX      0x00000010  // U0TX on PA1
#define GPIO_PCTL_PA1_CAN1TX    0x00000080  // CAN1TX on PA1
#define GPIO_PCTL_PA0_M         0x0000000F  // PA0 Mask
#define GPIO_PCTL_PA0_U0RX      0x00000001  // U0RX on PA0
#define GPIO_PCTL_PA0_CAN1RX    0x00000008  // CAN1RX on PA0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port B.
//
//*****************************************************************************
#define GPIO_PCTL_PB7_M         0xF0000000  // PB7 Mask
#define GPIO_PCTL_PB7_SSI2TX    0x20000000  // SSI2TX on PB7
#define GPIO_PCTL_PB7_M0PWM1    0x40000000  // M0PWM1 on PB7
#define GPIO_PCTL_PB7_T0CCP1    0x70000000  // T0CCP1 on PB7
#define GPIO_PCTL_PB6_M         0x0F000000  // PB6 Mask
#define GPIO_PCTL_PB6_SSI2RX    0x02000000  // SSI2RX on PB6
#define GPIO_PCTL_PB6_M0PWM0    0x04000000  // M0PWM0 on PB6
#define GPIO_PCTL_PB6_T0CCP0    0x07000000  // T0CCP0 on PB6
#define GPIO_PCTL_PB5_M         0x00F00000  // PB5 Mask
#define GPIO_PCTL_PB5_SSI2FSS   0x00200000  // SSI2FSS on PB5
#define GPIO_PCTL_PB5_M0PWM3    0x00400000  // M0PWM3 on PB5
#define GPIO_PCTL_PB5_T1CCP1    0x00700000  // T1CCP1 on PB5
#define GPIO_PCTL_PB5_CAN0TX    0x00800000  // CAN0TX on PB5
#define GPIO_PCTL_PB4_M         0x000F0000  // PB4 Mask
#define GPIO_PCTL_PB4_SSI2CLK   0x00020000  // SSI2CLK on PB4
#define GPIO_PCTL_PB4_M0PWM2    0x00040000  // M0PWM2 on PB4
#define GPIO_PCTL_PB4_T1CCP0    0x00070000  // T1CCP0 on PB4
#define GPIO_PCTL_PB4_CAN0RX    0x00080000  // CAN0RX on PB4
#define GPIO_PCTL_PB3_M         0x0000F000  // PB3 Mask
#define GPIO_PCTL_PB3_I2C0SDA   0x00003000  // I2C0SDA on PB3
#define GPIO_PCTL_PB3_T3CCP1    0x00007000  // T3CCP1 on PB3
#define GPIO_PCTL_PB2_M         0x00000F00  // PB2 Mask
#define GPIO_PCTL_PB2_I2C0SCL   0x00000300  // I2C0SCL on PB2
#define GPIO_PCTL_PB2_T3CCP0    0x00000700  // T3CCP0 on PB2
#define GPIO_PCTL_PB1_M         0x000000F0  // PB1 Mask
#define GPIO_PCTL_PB1_USB0VBUS  0x00000000  // USB0VBUS on PB1
#define GPIO_PCTL_PB1_U1TX      0x00000010  // U1TX on PB1
#define GPIO_PCTL_PB1_T2CCP1    0x00000070  // T2CCP1 on PB1
#define GPIO_PCTL_PB0_M         0x0000000F  // PB0 Mask
#define GPIO_PCTL_PB0_USB0ID    0x00000000  // USB0ID on PB0
#define GPIO_PCTL_PB0_U1RX      0x00000001  // U1RX on PB0
#define GPIO_PCTL_PB0_T2CCP0    0x00000007  // T2CCP0 on PB0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port C.
//
//*****************************************************************************
#define GPIO_PCTL_PC7_M         0xF0000000  // PC7 Mask
#define GPIO_PCTL_PC7_U3TX      0x10000000  // U3TX on PC7
#define GPIO_PCTL_PC7_WT1CCP1   0x70000000  // WT1CCP1 on PC7
#define GPIO_PCTL_PC7_USB0PFLT  0x80000000  // USB0PFLT on PC7
#define GPIO_PCTL_PC6_M         0x0F000000  // PC6 Mask
#define GPIO_PCTL_PC6_U3RX      0x01000000  // U3RX on PC6
#define GPIO_PCTL_PC6_PHB1      0x06000000  // PHB1 on PC6
#define GPIO_PCTL_PC6_WT1CCP0   0x07000000  // WT1CCP0 on PC6
#define GPIO_PCTL_PC6_USB0EPEN  0x08000000  // USB0EPEN on PC6
#define GPIO_PCTL_PC5_M         0x00F00000  // PC5 Mask
#define GPIO_PCTL_PC5_U4TX      0x00100000  // U4TX on PC5
#define GPIO_PCTL_PC5_U1TX      0x00200000  // U1TX on PC5
#define GPIO_PCTL_PC5_M0PWM7    0x00400000  // M0PWM7 on PC5
#define GPIO_PCTL_PC5_PHA1      0x00600000  // PHA1 on PC5
#define GPIO_PCTL_PC5_WT0CCP1   0x00700000  // WT0CCP1 on PC5
#define GPIO_PCTL_PC5_U1CTS     0x00800000  // U1CTS on PC5
#define GPIO_PCTL_PC4_M         0x000F0000  // PC4 Mask
#define GPIO_PCTL_PC4_U4RX      0x00010000  // U4RX on PC4
#define GPIO_PCTL_PC4_U1RX      0x00020000  // U1RX on PC4
#define GPIO_PCTL_PC4_M0PWM6    0x00040000  // M0PWM6 on PC4
#define GPIO_PCTL_PC4_IDX1      0x00060000  // IDX1 on PC4
#define GPIO_PCTL_PC4_WT0CCP0   0x00070000  // WT0CCP0 on PC4
#define GPIO_PCTL_PC4_U1RTS     0x00080000  // U1RTS on PC4
#define GPIO_PCTL_PC3_M         0x0000F000  // PC3 Mask
#define GPIO_PCTL_PC3_TDO       0x00001000  // TDO on PC3
#define GPIO_PCTL_PC3_T5CCP1    0x00007000  // T5CCP1 on PC3
#define GPIO_PCTL_PC2_M         0x00000F00  // PC2 Mask
#define GPIO_PCTL_PC2_TDI       0x00000100  // TDI on PC2
#define GPIO_PCTL_PC2_T5CCP0    0x00000700  // T5CCP0 on PC2
#define GPIO_PCTL_PC1_M         0x000000F0  // PC1 Mask
#define GPIO_PCTL_PC1_TMS       0x00000010  // TMS on PC1
#define GPIO_PCTL_PC1_T4CCP1    0x00000070  // T4CCP1 on PC1
#define GPIO_PCTL_PC0_M         0x0000000F  // PC0 Mask
#define GPIO_PCTL_PC0_TCK       0x00000001  // TCK on PC0
#define GPIO_PCTL_PC0_T4CCP0    0x00000007  // T4CCP0 on PC0

